export const enum ShipId {
  "睦月" = 1,
  "如月" = 2,
  "長月" = 6,
  "三日月" = 7,
  "吹雪" = 9,
  "白雪" = 10,
  "深雪" = 11,
  "磯波" = 12,
  "綾波" = 13,
  "敷波" = 14,
  "曙" = 15,
  "潮" = 16,
  "陽炎" = 17,
  "不知火" = 18,
  "黒潮" = 19,
  "雪風" = 20,
  "長良" = 21,
  "五十鈴" = 22,
  "由良" = 23,
  "大井" = 24,
  "北上" = 25,
  "扶桑" = 26,
  "山城" = 27,
  "皐月" = 28,
  "文月" = 29,
  "菊月" = 30,
  "望月" = 31,
  "初雪" = 32,
  "叢雲" = 33,
  "暁" = 34,
  "響" = 35,
  "雷" = 36,
  "電" = 37,
  "初春" = 38,
  "子日" = 39,
  "若葉" = 40,
  "初霜" = 41,
  "白露" = 42,
  "時雨" = 43,
  "村雨" = 44,
  "夕立" = 45,
  "五月雨" = 46,
  "涼風" = 47,
  "霰" = 48,
  "霞" = 49,
  "島風" = 50,
  "天龍" = 51,
  "龍田" = 52,
  "名取" = 53,
  "川内" = 54,
  "神通" = 55,
  "那珂" = 56,
  "大井改" = 57,
  "北上改" = 58,
  "古鷹" = 59,
  "加古" = 60,
  "青葉" = 61,
  "妙高" = 62,
  "那智" = 63,
  "足柄" = 64,
  "羽黒" = 65,
  "高雄" = 66,
  "愛宕" = 67,
  "摩耶" = 68,
  "鳥海" = 69,
  "最上" = 70,
  "利根" = 71,
  "筑摩" = 72,
  "最上改" = 73,
  "祥鳳" = 74,
  "飛鷹" = 75,
  "龍驤" = 76,
  "伊勢" = 77,
  "金剛" = 78,
  "榛名" = 79,
  "長門" = 80,
  "陸奥" = 81,
  "伊勢改" = 82,
  "赤城" = 83,
  "加賀" = 84,
  "霧島" = 85,
  "比叡" = 86,
  "日向" = 87,
  "日向改" = 88,
  "鳳翔" = 89,
  "蒼龍" = 90,
  "飛龍" = 91,
  "隼鷹" = 92,
  "朧" = 93,
  "漣" = 94,
  "朝潮" = 95,
  "大潮" = 96,
  "満潮" = 97,
  "荒潮" = 98,
  "球磨" = 99,
  "多摩" = 100,
  "木曾" = 101,
  "千歳" = 102,
  "千代田" = 103,
  "千歳改" = 104,
  "千代田改" = 105,
  "千歳甲" = 106,
  "千代田甲" = 107,
  "千歳航" = 108,
  "千代田航" = 109,
  "翔鶴" = 110,
  "瑞鶴" = 111,
  "瑞鶴改" = 112,
  "鬼怒" = 113,
  "阿武隈" = 114,
  "夕張" = 115,
  "瑞鳳" = 116,
  "瑞鳳改" = 117,
  "大井改二" = 118,
  "北上改二" = 119,
  "三隈" = 120,
  "三隈改" = 121,
  "舞風" = 122,
  "衣笠" = 123,
  "鈴谷" = 124,
  "熊野" = 125,
  "伊168" = 126,
  "伊58" = 127,
  "伊8" = 128,
  "鈴谷改" = 129,
  "熊野改" = 130,
  "大和" = 131,
  "秋雲" = 132,
  "夕雲" = 133,
  "巻雲" = 134,
  "長波" = 135,
  "大和改" = 136,
  "阿賀野" = 137,
  "能代" = 138,
  "矢矧" = 139,
  "酒匂" = 140,
  "五十鈴改二" = 141,
  "衣笠改二" = 142,
  "武蔵" = 143,
  "夕立改二" = 144,
  "時雨改二" = 145,
  "木曾改二" = 146,
  "Верный" = 147,
  "武蔵改" = 148,
  "金剛改二" = 149,
  "比叡改二" = 150,
  "榛名改二" = 151,
  "霧島改二" = 152,
  "大鳳" = 153,
  "香取" = 154,
  "伊401" = 155,
  "大鳳改" = 156,
  "龍驤改二" = 157,
  "川内改二" = 158,
  "神通改二" = 159,
  "那珂改二" = 160,
  "あきつ丸" = 161,
  "神威" = 162,
  "まるゆ" = 163,
  "弥生" = 164,
  "卯月" = 165,
  "あきつ丸改" = 166,
  "磯風" = 167,
  "浦風" = 168,
  "谷風" = 169,
  "浜風" = 170,
  "Bismarck" = 171,
  "Bismarck改" = 172,
  "Bismarck zwei" = 173,
  "Z1" = 174,
  "Z3" = 175,
  "Prinz Eugen" = 176,
  "Prinz Eugen改" = 177,
  "Bismarck drei" = 178,
  "Z1 zwei" = 179,
  "Z3 zwei" = 180,
  "天津風" = 181,
  "明石" = 182,
  "大淀" = 183,
  "大鯨" = 184,
  "龍鳳" = 185,
  "時津風" = 186,
  "明石改" = 187,
  "利根改二" = 188,
  "筑摩改二" = 189,
  "初風" = 190,
  "伊19" = 191,
  "那智改二" = 192,
  "足柄改二" = 193,
  "羽黒改二" = 194,
  "綾波改二" = 195,
  "飛龍改二" = 196,
  "蒼龍改二" = 197,
  "霰改二" = 198,
  "大潮改二" = 199,
  "阿武隈改二" = 200,
  "吹雪改" = 201,
  "白雪改" = 202,
  "初雪改" = 203,
  "深雪改" = 204,
  "叢雲改" = 205,
  "磯波改" = 206,
  "綾波改" = 207,
  "敷波改" = 208,
  "金剛改" = 209,
  "比叡改" = 210,
  "榛名改" = 211,
  "霧島改" = 212,
  "天龍改" = 213,
  "龍田改" = 214,
  "球磨改" = 215,
  "多摩改" = 216,
  "木曾改" = 217,
  "長良改" = 218,
  "五十鈴改" = 219,
  "由良改" = 220,
  "名取改" = 221,
  "川内改" = 222,
  "神通改" = 223,
  "那珂改" = 224,
  "陽炎改" = 225,
  "不知火改" = 226,
  "黒潮改" = 227,
  "雪風改" = 228,
  "島風改" = 229,
  "朧改" = 230,
  "曙改" = 231,
  "漣改" = 232,
  "潮改" = 233,
  "暁改" = 234,
  "響改" = 235,
  "雷改" = 236,
  "電改" = 237,
  "初春改" = 238,
  "子日改" = 239,
  "若葉改" = 240,
  "初霜改" = 241,
  "白露改" = 242,
  "時雨改" = 243,
  "村雨改" = 244,
  "夕立改" = 245,
  "五月雨改" = 246,
  "涼風改" = 247,
  "朝潮改" = 248,
  "大潮改" = 249,
  "満潮改" = 250,
  "荒潮改" = 251,
  "霰改" = 252,
  "霞改" = 253,
  "睦月改" = 254,
  "如月改" = 255,
  "皐月改" = 256,
  "文月改" = 257,
  "長月改" = 258,
  "菊月改" = 259,
  "三日月改" = 260,
  "望月改" = 261,
  "古鷹改" = 262,
  "加古改" = 263,
  "青葉改" = 264,
  "妙高改" = 265,
  "那智改" = 266,
  "足柄改" = 267,
  "羽黒改" = 268,
  "高雄改" = 269,
  "愛宕改" = 270,
  "摩耶改" = 271,
  "鳥海改" = 272,
  "利根改" = 273,
  "筑摩改" = 274,
  "長門改" = 275,
  "陸奥改" = 276,
  "赤城改" = 277,
  "加賀改" = 278,
  "蒼龍改" = 279,
  "飛龍改" = 280,
  "龍驤改" = 281,
  "祥鳳改" = 282,
  "飛鷹改" = 283,
  "隼鷹改" = 284,
  "鳳翔改" = 285,
  "扶桑改" = 286,
  "山城改" = 287,
  "翔鶴改" = 288,
  "鬼怒改" = 289,
  "阿武隈改" = 290,
  "千歳航改" = 291,
  "千代田航改" = 292,
  "夕張改" = 293,
  "舞風改" = 294,
  "衣笠改" = 295,
  "千歳航改二" = 296,
  "千代田航改二" = 297,
  "初風改" = 300,
  "秋雲改" = 301,
  "夕雲改" = 302,
  "巻雲改" = 303,
  "長波改" = 304,
  "阿賀野改" = 305,
  "能代改" = 306,
  "矢矧改" = 307,
  "弥生改" = 308,
  "卯月改" = 309,
  "Z1改" = 310,
  "Z3改" = 311,
  "浜風改" = 312,
  "谷風改" = 313,
  "酒匂改" = 314,
  "天津風改" = 316,
  "浦風改" = 317,
  "龍鳳改" = 318,
  "妙高改二" = 319,
  "磯風改" = 320,
  "大淀改" = 321,
  "時津風改" = 322,
  "春雨改" = 323,
  "早霜改" = 324,
  "清霜改" = 325,
  "初春改二" = 326,
  "朝雲改" = 327,
  "山雲改" = 328,
  "野分改" = 329,
  "秋月改" = 330,
  "天城" = 331,
  "葛城" = 332,
  "U-511改" = 334,
  "香取改" = 343,
  "朝霜改" = 344,
  "高波改" = 345,
  "照月改" = 346,
  "Libeccio改" = 347,
  "瑞穂改" = 348,
  "風雲改" = 349,
  "海風改" = 350,
  "江風改" = 351,
  "速吸改" = 352,
  "Graf Zeppelin改" = 353,
  "嵐改" = 354,
  "萩風改" = 355,
  "鹿島改" = 356,
  "初月改" = 357,
  "Zara改" = 358,
  "沖波改" = 359,
  "Iowa改" = 360,
  "Pola改" = 361,
  "親潮改" = 362,
  "春風改" = 363,
  "Warspite改" = 364,
  "Aquila改" = 365,
  "水無月改" = 366,
  "伊26改" = 367,
  "浦波改" = 368,
  "山風改" = 369,
  "朝風改" = 370,
  "松風改" = 371,
  "Commandant Teste改" = 372,
  "藤波改" = 373,
  "伊13改" = 374,
  "伊14改" = 375,
  "占守改" = 376,
  "国後改" = 377,
  "八丈改" = 378,
  "石垣改" = 379,
  "大鷹改" = 380,
  "神鷹改" = 381,
  "択捉改" = 383,
  "松輪改" = 384,
  "佐渡改" = 385,
  "対馬改" = 386,
  "旗風改" = 387,
  "天霧改" = 390,
  "狭霧改" = 391,
  "Richelieu改" = 392,
  "Ark Royal改" = 393,
  "Jervis改" = 394,
  "Ташкент改" = 395,
  "Gambier Bay改" = 396,
  "Intrepid改" = 397,
  "伊168改" = 398,
  "伊58改" = 399,
  "伊8改" = 400,
  "伊19改" = 401,
  "まるゆ改" = 402,
  "伊401改" = 403,
  "雲龍" = 404,
  "春雨" = 405,
  "雲龍改" = 406,
  "潮改二" = 407,
  "隼鷹改二" = 408,
  "早霜" = 409,
  "清霜" = 410,
  "扶桑改二" = 411,
  "山城改二" = 412,
  "朝雲" = 413,
  "山雲" = 414,
  "野分" = 415,
  "古鷹改二" = 416,
  "加古改二" = 417,
  "皐月改二" = 418,
  "初霜改二" = 419,
  "叢雲改二" = 420,
  "秋月" = 421,
  "照月" = 422,
  "初月" = 423,
  "高波" = 424,
  "朝霜" = 425,
  "吹雪改二" = 426,
  "鳥海改二" = 427,
  "摩耶改二" = 428,
  "天城改" = 429,
  "葛城改" = 430,
  "U-511" = 431,
  "Graf Zeppelin" = 432,
  "Saratoga" = 433,
  "睦月改二" = 434,
  "如月改二" = 435,
  "呂500" = 436,
  "暁改二" = 437,
  "Saratoga改" = 438,
  "Warspite" = 439,
  "Iowa" = 440,
  "Littorio" = 441,
  "Roma" = 442,
  "Libeccio" = 443,
  "Aquila" = 444,
  "秋津洲" = 445,
  "Italia" = 446,
  "Roma改" = 447,
  "Zara" = 448,
  "Pola" = 449,
  "秋津洲改" = 450,
  "瑞穂" = 451,
  "沖波" = 452,
  "風雲" = 453,
  "嵐" = 454,
  "萩風" = 455,
  "親潮" = 456,
  "山風" = 457,
  "海風" = 458,
  "江風" = 459,
  "速吸" = 460,
  "翔鶴改二" = 461,
  "瑞鶴改二" = 462,
  "朝潮改二" = 463,
  "霞改二" = 464,
  "鹿島" = 465,
  "翔鶴改二甲" = 466,
  "瑞鶴改二甲" = 467,
  "朝潮改二丁" = 468,
  "江風改二" = 469,
  "霞改二乙" = 470,
  "神風" = 471,
  "朝風" = 472,
  "春風" = 473,
  "松風" = 474,
  "旗風" = 475,
  "神風改" = 476,
  "天龍改二" = 477,
  "龍田改二" = 478,
  "天霧" = 479,
  "狭霧" = 480,
  "水無月" = 481,
  "伊26" = 483,
  "浜波" = 484,
  "藤波" = 485,
  "浦波" = 486,
  "鬼怒改二" = 487,
  "由良改二" = 488,
  "満潮改二" = 489,
  "荒潮改二" = 490,
  "Commandant Teste" = 491,
  "Richelieu" = 492,
  "伊400" = 493,
  "伊13" = 494,
  "伊14" = 495,
  "Zara due" = 496,
  "白露改二" = 497,
  "村雨改二" = 498,
  "神威改" = 499,
  "神威改母" = 500,
  "鈴谷改二" = 503,
  "熊野改二" = 504,
  "鈴谷航改二" = 508,
  "熊野航改二" = 509,
  "Гангут" = 511,
  "Октябрьская революция" = 512,
  "Гангут два" = 513,
  "Ark Royal" = 515,
  "Ташкент" = 516,
  "占守" = 517,
  "国後" = 518,
  "Jervis" = 519,
  "Janus" = 520,
  "春日丸" = 521,
  "択捉" = 524,
  "松輪" = 525,
  "大鷹" = 526,
  "岸波" = 527,
  "早波" = 528,
  "大鷹改二" = 529,
  "伊504" = 530,
  "佐渡" = 531,
  "涼月" = 532,
  "神鷹" = 534,
  "Luigi Torelli" = 535,
  "神鷹改二" = 536,
  "涼月改" = 537,
  "UIT-25" = 539,
  "対馬" = 540,
  "長門改二" = 541,
  "夕雲改二" = 542,
  "長波改二" = 543,
  "Gambier Bay" = 544,
  "Saratoga Mk.II" = 545,
  "武蔵改二" = 546,
  "多摩改二" = 547,
  "文月改二" = 548,
  "Intrepid" = 549,
  "Saratoga Mk.II Mod.2" = 550,
  "日振" = 551,
  "大東" = 552,
  "伊勢改二" = 553,
  "日向改二" = 554,
  "瑞鳳改二" = 555,
  "浦風丁改" = 556,
  "磯風乙改" = 557,
  "浜風乙改" = 558,
  "谷風丁改" = 559,
  "瑞鳳改二乙" = 560,
  "Samuel B.Roberts" = 561,
  "Johnston" = 562,
  "巻雲改二" = 563,
  "風雲改二" = 564,
  "福江" = 565,
  "陽炎改二" = 566,
  "不知火改二" = 567,
  "黒潮改二" = 568,
  "沖波改二" = 569,
  "平戸" = 570,
  "Nelson" = 571,
  "陸奥改二" = 573,
  "Gotland" = 574,
  "Maestrale" = 575,
  "Nelson改" = 576,
  "朝霜改二" = 578,
  "Gotland改" = 579,
  "Maestrale改" = 580,
  "日進" = 581,
  "峯雲" = 583,
  "八丈" = 584,
  "石垣" = 585,
  "日進甲" = 586,
  "海風改二" = 587,
  "L.d.S.D.d.Abruzzi" = 589,
  "G.Garibaldi" = 590,
  "金剛改二丙" = 591,
  "比叡改二丙" = 592,
  "赤城改二" = 594,
  "Houston" = 595,
  "Fletcher" = 596,
  "Atlanta" = 597,
  "赤城改二戊" = 599,
  "Houston改" = 600,
  "Colorado" = 601,
  "South Dakota" = 602,
  "Hornet" = 603,
  "De Ruyter" = 604,
  "Luigi Torelli改" = 605,
  "伊400改" = 606,
  "伊47改" = 607,
  "De Ruyter改" = 609,
  "加賀改二戊" = 610,
  "御蔵" = 611,
  "屋代" = 612,
  "Perth" = 613,
  "Grecale" = 614,
  "Helena" = 615,
  "御蔵改" = 616,
  "屋代改" = 617,
  "Perth改" = 618,
  "Grecale改" = 619,
  "Helena改" = 620,
  "神州丸" = 621,
  "夕張改二" = 622,
  "夕張改二特" = 623,
  "夕張改二丁" = 624,
  "秋霜" = 625,
  "神州丸改" = 626,
  "敷波改二" = 627,
  "Fletcher改 Mod.2" = 628,
  "Fletcher Mk.II" = 629,
  "Gotland andra" = 630,
  "薄雲" = 631,
  "有明" = 632,
  "迅鯨" = 634,
  "伊47" = 636,
  "第四号海防艦" = 637,
  "迅鯨改" = 639,
  "松" = 641,
  "加賀改二護" = 646,
  "秋雲改二" = 648,
  "日振改" = 678,
  "大東改" = 679,
  "浜波改" = 680,
  "Samuel B.Roberts改" = 681,
  "平戸改" = 684,
  "福江改" = 685,
  "岸波改" = 686,
  "峯雲改" = 687,
  "早波改" = 688,
  "Johnston改" = 689,
  "日進改" = 690,
  "G.Garibaldi改" = 691,
  "Fletcher改" = 692,
  "L.d.S.D.d.Abruzzi改" = 693,
  "秋霜改" = 695,
  "Atlanta改" = 696,
  "South Dakota改" = 697,
  "加賀改二" = 698,
  "薄雲改" = 700,
  "第四号海防艦改" = 701,
  "松改" = 702,
  "有明改" = 703,
  "Hornet改" = 704,
  "Janus改" = 893,
  "Colorado改" = 1496,
  "駆逐イ級 id1501" = 1501,
  "駆逐ロ級 id1502" = 1502,
  "駆逐ハ級 id1503" = 1503,
  "駆逐ニ級 id1504" = 1504,
  "軽巡ホ級 id1505" = 1505,
  "軽巡ヘ級 id1506" = 1506,
  "軽巡ト級 id1507" = 1507,
  "雷巡チ級 id1508" = 1508,
  "重巡リ級 id1509" = 1509,
  "軽母ヌ級 id1510" = 1510,
  "戦艦ル級 id1511" = 1511,
  "空母ヲ級 id1512" = 1512,
  "輸送ワ級 id1513" = 1513,
  "駆逐イ級 id1514" = 1514,
  "駆逐ロ級 id1515" = 1515,
  "駆逐ハ級 id1516" = 1516,
  "駆逐ニ級 id1517" = 1517,
  "軽巡ホ級 id1518" = 1518,
  "軽巡ヘ級 id1519" = 1519,
  "軽巡ト級 id1520" = 1520,
  "雷巡チ級 id1521" = 1521,
  "重巡リ級 id1522" = 1522,
  "軽母ヌ級 id1523" = 1523,
  "戦艦ル級 id1524" = 1524,
  "空母ヲ級 id1525" = 1525,
  "輸送ワ級 id1526" = 1526,
  "重巡リ級 id1527" = 1527,
  "空母ヲ級 id1528" = 1528,
  "戦艦ル級 id1529" = 1529,
  "潜水カ級 id1530" = 1530,
  "潜水ヨ級 id1531" = 1531,
  "潜水カ級 id1532" = 1532,
  "潜水ヨ級 id1533" = 1533,
  "潜水カ級 id1534" = 1534,
  "潜水ヨ級 id1535" = 1535,
  "浮遊要塞 id1536" = 1536,
  "浮遊要塞 id1537" = 1537,
  "浮遊要塞 id1538" = 1538,
  "泊地棲鬼" = 1539,
  "泊地棲姫" = 1540,
  "戦艦タ級 id1541" = 1541,
  "戦艦タ級 id1542" = 1542,
  "戦艦タ級 id1543" = 1543,
  "装甲空母鬼" = 1544,
  "装甲空母姫" = 1545,
  "南方棲鬼" = 1546,
  "南方棲戦鬼" = 1547,
  "南方棲戦姫" = 1548,
  "護衛要塞 id1549" = 1549,
  "護衛要塞 id1550" = 1550,
  "護衛要塞 id1551" = 1551,
  "駆逐ロ級 id1552" = 1552,
  "駆逐ハ級 id1553" = 1553,
  "軽巡ホ級 id1554" = 1554,
  "軽巡ヘ級 id1555" = 1555,
  "飛行場姫 id1556" = 1556,
  "戦艦棲姫" = 1557,
  "輸送ワ級 id1558" = 1558,
  "雷巡チ級 id1559" = 1559,
  "軽母ヌ級 id1560" = 1560,
  "戦艦レ級 id1561" = 1561,
  "戦艦レ級 id1562" = 1562,
  "駆逐イ級 id1564" = 1564,
  "空母ヲ級改 id1565" = 1565,
  "重巡リ級改" = 1566,
  "戦艦ル級改" = 1567,
  "潜水ソ級 id1570" = 1570,
  "潜水ソ級 id1571" = 1571,
  "潜水ソ級 id1572" = 1572,
  "港湾棲姫 id1573" = 1573,
  "離島棲鬼 id1574" = 1574,
  "駆逐イ級後期型 id1575" = 1575,
  "駆逐ロ級後期型 id1576" = 1576,
  "駆逐ハ級後期型 id1577" = 1577,
  "駆逐ニ級後期型 id1578" = 1578,
  "空母ヲ級 id1579" = 1579,
  "北方棲姫 id1581" = 1581,
  "北方棲姫 id1582" = 1582,
  "中間棲姫 id1583" = 1583,
  "中間棲姫 id1584" = 1584,
  "空母棲鬼 id1585" = 1585,
  "空母棲姫 id1586" = 1586,
  "北方棲姫 id1587" = 1587,
  "北方棲姫 id1588" = 1588,
  "北方棲姫 id1589" = 1589,
  "北方棲姫 id1590" = 1590,
  "軽巡ツ級 id1591" = 1591,
  "軽巡ツ級 id1592" = 1592,
  "重巡ネ級 id1594" = 1594,
  "重巡ネ級 id1595" = 1595,
  "駆逐棲姫 id1597" = 1597,
  "駆逐棲姫 id1598" = 1598,
  "空母水鬼 id1599" = 1599,
  "空母水鬼 id1600" = 1600,
  "軽巡棲鬼 id1601" = 1601,
  "軽巡棲鬼 id1602" = 1602,
  "戦艦水鬼 id1603" = 1603,
  "戦艦水鬼 id1604" = 1604,
  "港湾水鬼 id1605" = 1605,
  "港湾水鬼 id1606" = 1606,
  "港湾水鬼 id1607" = 1607,
  "港湾水鬼 id1608" = 1608,
  "泊地水鬼 id1609" = 1609,
  "泊地水鬼 id1610" = 1610,
  "泊地水鬼 id1611" = 1611,
  "泊地水鬼 id1612" = 1612,
  "港湾棲姫 id1613" = 1613,
  "空母ヲ級 id1614" = 1614,
  "空母ヲ級 id1615" = 1615,
  "空母ヲ級改 id1616" = 1616,
  "空母ヲ級改 id1617" = 1617,
  "空母ヲ級改 id1618" = 1618,
  "空母棲鬼 id1619" = 1619,
  "空母棲姫 id1620" = 1620,
  "駆逐イ級後期型 id1621" = 1621,
  "駆逐ロ級後期型 id1622" = 1622,
  "駆逐ハ級後期型 id1623" = 1623,
  "駆逐ニ級後期型 id1624" = 1624,
  "水母棲姫 id1625" = 1625,
  "水母棲姫 id1626" = 1626,
  "水母棲姫 id1627" = 1627,
  "防空棲姫 id1628" = 1628,
  "防空棲姫 id1629" = 1629,
  "防空棲姫 id1630" = 1630,
  "飛行場姫 id1631" = 1631,
  "飛行場姫 id1632" = 1632,
  "飛行場姫 id1633" = 1633,
  "離島棲鬼 id1634" = 1634,
  "離島棲鬼 id1635" = 1635,
  "離島棲鬼 id1636" = 1636,
  "PT小鬼群 id1637" = 1637,
  "PT小鬼群 id1638" = 1638,
  "PT小鬼群 id1639" = 1639,
  "PT小鬼群 id1640" = 1640,
  "軽巡棲姫 id1641" = 1641,
  "軽巡棲姫 id1642" = 1642,
  "軽巡棲姫 id1643" = 1643,
  "潜水棲姫 id1644" = 1644,
  "潜水棲姫 id1645" = 1645,
  "潜水棲姫 id1646" = 1646,
  "駆逐水鬼 id1647" = 1647,
  "駆逐水鬼 id1648" = 1648,
  "駆逐水鬼 id1649" = 1649,
  "飛行場姫 id1650" = 1650,
  "飛行場姫 id1651" = 1651,
  "飛行場姫 id1652" = 1652,
  "集積地棲姫 id1653" = 1653,
  "集積地棲姫 id1654" = 1654,
  "集積地棲姫 id1655" = 1655,
  "集積地棲姫-壊 id1656" = 1656,
  "集積地棲姫-壊 id1657" = 1657,
  "集積地棲姫-壊 id1658" = 1658,
  "重巡棲姫 id1659" = 1659,
  "重巡棲姫 id1660" = 1660,
  "重巡棲姫 id1661" = 1661,
  "重巡棲姫 id1662" = 1662,
  "重巡棲姫 id1663" = 1663,
  "重巡棲姫 id1664" = 1664,
  "砲台小鬼 id1665" = 1665,
  "砲台小鬼 id1666" = 1666,
  "砲台小鬼 id1667" = 1667,
  "離島棲姫 id1668" = 1668,
  "離島棲姫 id1669" = 1669,
  "離島棲姫 id1670" = 1670,
  "離島棲姫 id1671" = 1671,
  "離島棲姫 id1672" = 1672,
  "駆逐古鬼 id1673" = 1673,
  "駆逐古鬼 id1674" = 1674,
  "駆逐古鬼 id1675" = 1675,
  "駆逐水鬼 id1676" = 1676,
  "駆逐水鬼 id1677" = 1677,
  "駆逐水鬼 id1678" = 1678,
  "リコリス棲姫 id1679" = 1679,
  "リコリス棲姫 id1680" = 1680,
  "リコリス棲姫 id1681" = 1681,
  "リコリス棲姫 id1682" = 1682,
  "リコリス棲姫 id1683" = 1683,
  "中枢棲姫 id1684" = 1684,
  "中枢棲姫 id1685" = 1685,
  "中枢棲姫 id1686" = 1686,
  "中枢棲姫-壊 id1687" = 1687,
  "中枢棲姫-壊 id1688" = 1688,
  "中枢棲姫-壊 id1689" = 1689,
  "駆逐古姫 id1690" = 1690,
  "駆逐古姫 id1691" = 1691,
  "駆逐古姫 id1692" = 1692,
  "潜水夏姫 id1693" = 1693,
  "潜水夏姫 id1694" = 1694,
  "潜水夏姫 id1695" = 1695,
  "戦艦夏姫 id1696" = 1696,
  "戦艦夏姫 id1697" = 1697,
  "戦艦夏姫 id1698" = 1698,
  "港湾夏姫 id1699" = 1699,
  "港湾夏姫 id1700" = 1700,
  "港湾夏姫 id1701" = 1701,
  "港湾夏姫-壊 id1702" = 1702,
  "港湾夏姫-壊 id1703" = 1703,
  "港湾夏姫-壊 id1704" = 1704,
  "重巡夏姫 id1705" = 1705,
  "重巡夏姫 id1706" = 1706,
  "重巡夏姫 id1707" = 1707,
  "水母水姫 id1708" = 1708,
  "水母水姫 id1709" = 1709,
  "水母水姫 id1710" = 1710,
  "深海海月姫 id1711" = 1711,
  "深海海月姫 id1712" = 1712,
  "深海海月姫 id1713" = 1713,
  "空母ヲ級改 id1714" = 1714,
  "空母ヲ級改 id1715" = 1715,
  "深海双子棲姫 id1716" = 1716,
  "深海双子棲姫 id1717" = 1717,
  "深海双子棲姫 id1718" = 1718,
  "深海双子棲姫-壊 id1719" = 1719,
  "深海双子棲姫-壊 id1720" = 1720,
  "深海双子棲姫-壊 id1721" = 1721,
  "護衛棲姫 id1722" = 1722,
  "護衛棲姫 id1723" = 1723,
  "護衛棲姫 id1724" = 1724,
  "北端上陸姫 id1725" = 1725,
  "北端上陸姫 id1726" = 1726,
  "北端上陸姫 id1727" = 1727,
  "北方水姫 id1728" = 1728,
  "北方水姫 id1729" = 1729,
  "北方水姫 id1730" = 1730,
  "北方水姫-壊 id1731" = 1731,
  "北方水姫-壊 id1732" = 1732,
  "北方水姫-壊 id1733" = 1733,
  "軽母ヌ級改 id1734" = 1734,
  "軽母ヌ級改 id1735" = 1735,
  "潜水新棲姫 id1736" = 1736,
  "潜水新棲姫 id1737" = 1737,
  "潜水新棲姫 id1738" = 1738,
  "駆逐ナ級 id1739" = 1739,
  "駆逐ナ級 id1740" = 1740,
  "駆逐ナ級 id1741" = 1741,
  "駆逐ナ級後期型 id1742" = 1742,
  "駆逐ナ級後期型 id1743" = 1743,
  "駆逐ナ級後期型 id1744" = 1744,
  "戦艦仏棲姫 id1745" = 1745,
  "戦艦仏棲姫 id1746" = 1746,
  "戦艦仏棲姫 id1747" = 1747,
  "戦艦仏棲姫-壊 id1748" = 1748,
  "戦艦仏棲姫-壊 id1749" = 1749,
  "戦艦仏棲姫-壊 id1750" = 1750,
  "空母夏鬼" = 1751,
  "空母夏姫 id1752" = 1752,
  "集積地夏姫 id1753" = 1753,
  "集積地夏姫 id1754" = 1754,
  "欧州棲姫 id1755" = 1755,
  "欧州棲姫 id1756" = 1756,
  "欧州棲姫 id1757" = 1757,
  "欧州棲姫-壊 id1758" = 1758,
  "欧州棲姫-壊 id1759" = 1759,
  "欧州棲姫-壊 id1760" = 1760,
  "重巡ネ級 id1761" = 1761,
  "軽母ヌ級 id1762" = 1762,
  "軽母ヌ級 id1763" = 1763,
  "軽母ヌ級 id1764" = 1764,
  "軽母ヌ級改 id1765" = 1765,
  "軽母ヌ級改 id1766" = 1766,
  "海峡夜棲姫 id1767" = 1767,
  "海峡夜棲姫 id1768" = 1768,
  "海峡夜棲姫 id1769" = 1769,
  "海峡夜棲姫-壊 id1770" = 1770,
  "海峡夜棲姫-壊 id1771" = 1771,
  "海峡夜棲姫-壊 id1772" = 1772,
  "防空埋護姫 id1773" = 1773,
  "防空埋護姫 id1774" = 1774,
  "防空埋護姫 id1775" = 1775,
  "軽母ヌ級 id1776" = 1776,
  "軽母ヌ級 id1777" = 1777,
  "軽母ヌ級改 id1778" = 1778,
  "軽母ヌ級改 id1779" = 1779,
  "軽母ヌ級改 id1780" = 1780,
  "空母棲姫 id1781" = 1781,
  "空母棲姫 id1782" = 1782,
  "護衛棲水姫 id1783" = 1783,
  "護衛棲水姫 id1784" = 1784,
  "護衛棲水姫 id1785" = 1785,
  "護衛棲水姫-壊 id1786" = 1786,
  "護衛棲水姫-壊 id1787" = 1787,
  "護衛棲水姫-壊 id1788" = 1788,
  "潜水新棲姫 id1789" = 1789,
  "戦艦棲姫改 id1790" = 1790,
  "戦艦棲姫改 id1791" = 1791,
  "戦艦棲姫改 id1792" = 1792,
  "戦艦水鬼改 id1793" = 1793,
  "戦艦水鬼改 id1794" = 1794,
  "戦艦水鬼改 id1795" = 1795,
  "戦艦水鬼改-壊 id1796" = 1796,
  "戦艦水鬼改-壊 id1797" = 1797,
  "戦艦水鬼改-壊 id1798" = 1798,
  "深海鶴棲姫 id1799" = 1799,
  "深海鶴棲姫 id1800" = 1800,
  "深海鶴棲姫 id1801" = 1801,
  "深海鶴棲姫-壊 id1802" = 1802,
  "深海鶴棲姫-壊 id1803" = 1803,
  "深海鶴棲姫-壊 id1804" = 1804,
  "潜水新棲姫 バカンスmode id1805" = 1805,
  "潜水新棲姫 バカンスmode id1806" = 1806,
  "潜水新棲姫 バカンスmode id1807" = 1807,
  "潜水新棲姫 バカンスmode id1808" = 1808,
  "集積地棲姫 バカンスmode id1809" = 1809,
  "集積地棲姫 バカンスmode id1810" = 1810,
  "集積地棲姫 バカンスmode id1811" = 1811,
  "集積地棲姫 バカンスmode-壊 id1812" = 1812,
  "集積地棲姫 バカンスmode-壊 id1813" = 1813,
  "集積地棲姫 バカンスmode-壊 id1814" = 1814,
  "泊地水鬼 バカンスmode id1815" = 1815,
  "泊地水鬼 バカンスmode id1816" = 1816,
  "泊地水鬼 バカンスmode id1817" = 1817,
  "泊地水鬼 バカンスmode id1818" = 1818,
  "泊地水鬼 バカンスmode id1819" = 1819,
  "泊地水鬼 バカンスmode id1820" = 1820,
  "護衛独還姫 id1821" = 1821,
  "護衛独還姫 id1822" = 1822,
  "護衛独還姫 id1823" = 1823,
  "護衛独還姫-壊 id1824" = 1824,
  "護衛独還姫-壊 id1825" = 1825,
  "護衛独還姫-壊 id1826" = 1826,
  "船渠棲姫 id1827" = 1827,
  "船渠棲姫 id1828" = 1828,
  "船渠棲姫 id1829" = 1829,
  "船渠棲姫-壊 id1830" = 1830,
  "船渠棲姫-壊 id1831" = 1831,
  "船渠棲姫-壊 id1832" = 1832,
  "戦艦仏棲姫 バカンスmode id1834" = 1834,
  "戦艦仏棲姫 バカンスmode id1835" = 1835,
  "戦艦仏棲姫 バカンスmode id1836" = 1836,
  "戦艦仏棲姫-壊 バカンスmode id1837" = 1837,
  "戦艦仏棲姫-壊 バカンスmode id1838" = 1838,
  "戦艦仏棲姫-壊 バカンスmode id1839" = 1839,
  "欧州水姫 id1840" = 1840,
  "欧州水姫 id1841" = 1841,
  "欧州水姫 id1842" = 1842,
  "欧州水姫-壊 id1843" = 1843,
  "欧州水姫-壊 id1844" = 1844,
  "欧州水姫-壊 id1845" = 1845,
  "深海雨雲姫 id1846" = 1846,
  "深海雨雲姫 id1847" = 1847,
  "深海雨雲姫 id1848" = 1848,
  "深海雨雲姫-壊 id1849" = 1849,
  "深海雨雲姫-壊 id1850" = 1850,
  "深海雨雲姫-壊 id1851" = 1851,
  "深海日棲姫 id1852" = 1852,
  "深海日棲姫 id1853" = 1853,
  "深海日棲姫 id1854" = 1854,
  "深海日棲姫-壊 id1855" = 1855,
  "深海日棲姫-壊 id1856" = 1856,
  "深海日棲姫-壊 id1857" = 1857,
  "駆逐ニ級改" = 1858,
  "駆逐ニ級改後期型 id1859" = 1859,
  "駆逐ニ級改後期型 id1860" = 1860,
  "駆逐ニ級改後期型 id1861" = 1861,
  "軽巡ツ級 id1862" = 1862,
  "重巡棲姫 id1863" = 1863,
  "重巡棲姫 id1864" = 1864,
  "北方棲妹 id1865" = 1865,
  "北方棲妹 id1866" = 1866,
  "北方棲妹 id1867" = 1867,
  "北方棲妹-壊 id1868" = 1868,
  "北方棲妹-壊 id1869" = 1869,
  "北方棲妹-壊 id1870" = 1870,
  "太平洋深海棲姫 id1871" = 1871,
  "太平洋深海棲姫 id1872" = 1872,
  "太平洋深海棲姫 id1873" = 1873,
  "太平洋深海棲姫-壊 id1874" = 1874,
  "太平洋深海棲姫-壊 id1875" = 1875,
  "太平洋深海棲姫-壊 id1876" = 1876,
  "深海地中海棲姫 id1877" = 1877,
  "深海地中海棲姫 id1878" = 1878,
  "深海地中海棲姫 id1879" = 1879,
  "深海地中海棲姫-壊 id1880" = 1880,
  "深海地中海棲姫-壊 id1881" = 1881,
  "深海地中海棲姫-壊 id1882" = 1882,
  "アンツィオ沖棲姫 id1883" = 1883,
  "アンツィオ沖棲姫 id1884" = 1884,
  "アンツィオ沖棲姫 id1885" = 1885,
  "アンツィオ沖棲姫-壊 id1886" = 1886,
  "アンツィオ沖棲姫-壊 id1887" = 1887,
  "アンツィオ沖棲姫-壊 id1888" = 1888,
  "飛行場姫 id1889" = 1889,
  "飛行場姫 id1890" = 1890,
  "飛行場姫 id1891" = 1891,
  "飛行場姫 id1892" = 1892,
  "飛行場姫 id1893" = 1893,
  "飛行場姫 id1894" = 1894,
  "重巡ネ級改 id1895" = 1895,
  "重巡ネ級改 id1896" = 1896,
  "重巡ネ級改 id1897" = 1897,
  "バタビア沖棲姫 id1898" = 1898,
  "バタビア沖棲姫 id1899" = 1899,
  "バタビア沖棲姫 id1900" = 1900,
  "バタビア沖棲姫-壊 id1901" = 1901,
  "バタビア沖棲姫-壊 id1902" = 1902,
  "バタビア沖棲姫-壊 id1903" = 1903,
  "軽巡ヘ級改 id1904" = 1904,
  "軽巡ヘ級改 id1905" = 1905,
  "空母棲姫改 id1906" = 1906,
  "空母棲姫改 id1907" = 1907,
  "空母棲姫改 id1908" = 1908,
  "防空巡棲姫 id1909" = 1909,
  "防空巡棲姫 id1910" = 1910,
  "防空巡棲姫 id1911" = 1911,
  "防空巡棲姫-壊 id1912" = 1912,
  "防空巡棲姫-壊 id1913" = 1913,
  "防空巡棲姫-壊 id1914" = 1914,
  "潜水棲姫改 id1915" = 1915,
  "潜水棲姫改 id1916" = 1916,
  "潜水棲姫改 id1917" = 1917,
  "潜水棲姫改-壊 id1918" = 1918,
  "潜水棲姫改-壊 id1919" = 1919,
  "潜水棲姫改-壊 id1920" = 1920,
  "集積地棲姫II id1921" = 1921,
  "集積地棲姫II id1922" = 1922,
  "集積地棲姫II id1923" = 1923,
  "集積地棲姫II-壊 id1924" = 1924,
  "集積地棲姫II-壊 id1925" = 1925,
  "集積地棲姫II-壊 id1926" = 1926,
  "深海千島棲姫 id1927" = 1927,
  "深海千島棲姫 id1928" = 1928,
  "深海千島棲姫 id1929" = 1929,
  "深海千島棲姫-壊 id1930" = 1930,
  "深海千島棲姫-壊 id1931" = 1931,
  "深海千島棲姫-壊 id1932" = 1932,
  "集積地棲姫II 夏季上陸mode id1933" = 1933,
  "集積地棲姫II 夏季上陸mode id1934" = 1934,
  "集積地棲姫II 夏季上陸mode id1935" = 1935,
  "集積地棲姫II 夏季上陸mode-壊 id1936" = 1936,
  "集積地棲姫II 夏季上陸mode-壊 id1937" = 1937,
  "集積地棲姫II 夏季上陸mode-壊 id1938" = 1938,
  "五島沖海底姫 id1939" = 1939,
  "五島沖海底姫 id1940" = 1940,
  "五島沖海底姫 id1941" = 1941,
  "五島沖海底姫-壊 id1942" = 1942,
  "五島沖海底姫-壊 id1943" = 1943,
  "五島沖海底姫-壊 id1944" = 1944,
  "駆逐林棲姫 id1945" = 1945,
  "駆逐林棲姫 id1946" = 1946,
  "駆逐林棲姫 id1947" = 1947,
  "駆逐林棲姫-壊 id1948" = 1948,
  "駆逐林棲姫-壊 id1949" = 1949,
  "駆逐林棲姫-壊 id1950" = 1950,
  "駆逐ナ級後期型II id1951" = 1951,
  "駆逐ナ級後期型II id1952" = 1952,
  "重巡ネ級改 夏mode id1953" = 1953,
  "重巡ネ級改 夏mode id1954" = 1954,
  "重巡ネ級改 夏mode id1955" = 1955,
  "重巡ネ級改II 夏mode" = 1956,
  "軽巡棲姫II id1957" = 1957,
  "軽巡棲姫II id1958" = 1958,
  "軽巡棲姫II id1959" = 1959,
  "軽巡棲姫II id1960" = 1960,
  "空母夏姫 id1961" = 1961,
  "空母夏姫 id1962" = 1962,
  "空母夏姫 id1963" = 1963,
  "空母夏姫II" = 1964,
  "南方戦艦新棲姫 id1965" = 1965,
  "南方戦艦新棲姫 id1966" = 1966,
  "南方戦艦新棲姫 id1967" = 1967,
  "南方戦艦新棲姫-壊 id1968" = 1968,
  "南方戦艦新棲姫-壊 id1969" = 1969,
  "南方戦艦新棲姫-壊 id1970" = 1970,
  "南太平洋空母棲姫 id1971" = 1971,
  "南太平洋空母棲姫 id1972" = 1972,
  "南太平洋空母棲姫 id1973" = 1973,
  "南太平洋空母棲姫-壊 id1974" = 1974,
  "南太平洋空母棲姫-壊 id1975" = 1975,
  "南太平洋空母棲姫-壊 id1976" = 1976,
  "潜水夏姫II id1977" = 1977,
  "潜水夏姫II id1978" = 1978,
}

export type ShipName =
  | "睦月"
  | "如月"
  | "長月"
  | "三日月"
  | "吹雪"
  | "白雪"
  | "深雪"
  | "磯波"
  | "綾波"
  | "敷波"
  | "曙"
  | "潮"
  | "陽炎"
  | "不知火"
  | "黒潮"
  | "雪風"
  | "長良"
  | "五十鈴"
  | "由良"
  | "大井"
  | "北上"
  | "扶桑"
  | "山城"
  | "皐月"
  | "文月"
  | "菊月"
  | "望月"
  | "初雪"
  | "叢雲"
  | "暁"
  | "響"
  | "雷"
  | "電"
  | "初春"
  | "子日"
  | "若葉"
  | "初霜"
  | "白露"
  | "時雨"
  | "村雨"
  | "夕立"
  | "五月雨"
  | "涼風"
  | "霰"
  | "霞"
  | "島風"
  | "天龍"
  | "龍田"
  | "名取"
  | "川内"
  | "神通"
  | "那珂"
  | "大井改"
  | "北上改"
  | "古鷹"
  | "加古"
  | "青葉"
  | "妙高"
  | "那智"
  | "足柄"
  | "羽黒"
  | "高雄"
  | "愛宕"
  | "摩耶"
  | "鳥海"
  | "最上"
  | "利根"
  | "筑摩"
  | "最上改"
  | "祥鳳"
  | "飛鷹"
  | "龍驤"
  | "伊勢"
  | "金剛"
  | "榛名"
  | "長門"
  | "陸奥"
  | "伊勢改"
  | "赤城"
  | "加賀"
  | "霧島"
  | "比叡"
  | "日向"
  | "日向改"
  | "鳳翔"
  | "蒼龍"
  | "飛龍"
  | "隼鷹"
  | "朧"
  | "漣"
  | "朝潮"
  | "大潮"
  | "満潮"
  | "荒潮"
  | "球磨"
  | "多摩"
  | "木曾"
  | "千歳"
  | "千代田"
  | "千歳改"
  | "千代田改"
  | "千歳甲"
  | "千代田甲"
  | "千歳航"
  | "千代田航"
  | "翔鶴"
  | "瑞鶴"
  | "瑞鶴改"
  | "鬼怒"
  | "阿武隈"
  | "夕張"
  | "瑞鳳"
  | "瑞鳳改"
  | "大井改二"
  | "北上改二"
  | "三隈"
  | "三隈改"
  | "舞風"
  | "衣笠"
  | "鈴谷"
  | "熊野"
  | "伊168"
  | "伊58"
  | "伊8"
  | "鈴谷改"
  | "熊野改"
  | "大和"
  | "秋雲"
  | "夕雲"
  | "巻雲"
  | "長波"
  | "大和改"
  | "阿賀野"
  | "能代"
  | "矢矧"
  | "酒匂"
  | "五十鈴改二"
  | "衣笠改二"
  | "武蔵"
  | "夕立改二"
  | "時雨改二"
  | "木曾改二"
  | "Верный"
  | "武蔵改"
  | "金剛改二"
  | "比叡改二"
  | "榛名改二"
  | "霧島改二"
  | "大鳳"
  | "香取"
  | "伊401"
  | "大鳳改"
  | "龍驤改二"
  | "川内改二"
  | "神通改二"
  | "那珂改二"
  | "あきつ丸"
  | "神威"
  | "まるゆ"
  | "弥生"
  | "卯月"
  | "あきつ丸改"
  | "磯風"
  | "浦風"
  | "谷風"
  | "浜風"
  | "Bismarck"
  | "Bismarck改"
  | "Bismarck zwei"
  | "Z1"
  | "Z3"
  | "Prinz Eugen"
  | "Prinz Eugen改"
  | "Bismarck drei"
  | "Z1 zwei"
  | "Z3 zwei"
  | "天津風"
  | "明石"
  | "大淀"
  | "大鯨"
  | "龍鳳"
  | "時津風"
  | "明石改"
  | "利根改二"
  | "筑摩改二"
  | "初風"
  | "伊19"
  | "那智改二"
  | "足柄改二"
  | "羽黒改二"
  | "綾波改二"
  | "飛龍改二"
  | "蒼龍改二"
  | "霰改二"
  | "大潮改二"
  | "阿武隈改二"
  | "吹雪改"
  | "白雪改"
  | "初雪改"
  | "深雪改"
  | "叢雲改"
  | "磯波改"
  | "綾波改"
  | "敷波改"
  | "金剛改"
  | "比叡改"
  | "榛名改"
  | "霧島改"
  | "天龍改"
  | "龍田改"
  | "球磨改"
  | "多摩改"
  | "木曾改"
  | "長良改"
  | "五十鈴改"
  | "由良改"
  | "名取改"
  | "川内改"
  | "神通改"
  | "那珂改"
  | "陽炎改"
  | "不知火改"
  | "黒潮改"
  | "雪風改"
  | "島風改"
  | "朧改"
  | "曙改"
  | "漣改"
  | "潮改"
  | "暁改"
  | "響改"
  | "雷改"
  | "電改"
  | "初春改"
  | "子日改"
  | "若葉改"
  | "初霜改"
  | "白露改"
  | "時雨改"
  | "村雨改"
  | "夕立改"
  | "五月雨改"
  | "涼風改"
  | "朝潮改"
  | "大潮改"
  | "満潮改"
  | "荒潮改"
  | "霰改"
  | "霞改"
  | "睦月改"
  | "如月改"
  | "皐月改"
  | "文月改"
  | "長月改"
  | "菊月改"
  | "三日月改"
  | "望月改"
  | "古鷹改"
  | "加古改"
  | "青葉改"
  | "妙高改"
  | "那智改"
  | "足柄改"
  | "羽黒改"
  | "高雄改"
  | "愛宕改"
  | "摩耶改"
  | "鳥海改"
  | "利根改"
  | "筑摩改"
  | "長門改"
  | "陸奥改"
  | "赤城改"
  | "加賀改"
  | "蒼龍改"
  | "飛龍改"
  | "龍驤改"
  | "祥鳳改"
  | "飛鷹改"
  | "隼鷹改"
  | "鳳翔改"
  | "扶桑改"
  | "山城改"
  | "翔鶴改"
  | "鬼怒改"
  | "阿武隈改"
  | "千歳航改"
  | "千代田航改"
  | "夕張改"
  | "舞風改"
  | "衣笠改"
  | "千歳航改二"
  | "千代田航改二"
  | "初風改"
  | "秋雲改"
  | "夕雲改"
  | "巻雲改"
  | "長波改"
  | "阿賀野改"
  | "能代改"
  | "矢矧改"
  | "弥生改"
  | "卯月改"
  | "Z1改"
  | "Z3改"
  | "浜風改"
  | "谷風改"
  | "酒匂改"
  | "天津風改"
  | "浦風改"
  | "龍鳳改"
  | "妙高改二"
  | "磯風改"
  | "大淀改"
  | "時津風改"
  | "春雨改"
  | "早霜改"
  | "清霜改"
  | "初春改二"
  | "朝雲改"
  | "山雲改"
  | "野分改"
  | "秋月改"
  | "天城"
  | "葛城"
  | "U-511改"
  | "香取改"
  | "朝霜改"
  | "高波改"
  | "照月改"
  | "Libeccio改"
  | "瑞穂改"
  | "風雲改"
  | "海風改"
  | "江風改"
  | "速吸改"
  | "Graf Zeppelin改"
  | "嵐改"
  | "萩風改"
  | "鹿島改"
  | "初月改"
  | "Zara改"
  | "沖波改"
  | "Iowa改"
  | "Pola改"
  | "親潮改"
  | "春風改"
  | "Warspite改"
  | "Aquila改"
  | "水無月改"
  | "伊26改"
  | "浦波改"
  | "山風改"
  | "朝風改"
  | "松風改"
  | "Commandant Teste改"
  | "藤波改"
  | "伊13改"
  | "伊14改"
  | "占守改"
  | "国後改"
  | "八丈改"
  | "石垣改"
  | "大鷹改"
  | "神鷹改"
  | "択捉改"
  | "松輪改"
  | "佐渡改"
  | "対馬改"
  | "旗風改"
  | "天霧改"
  | "狭霧改"
  | "Richelieu改"
  | "Ark Royal改"
  | "Jervis改"
  | "Ташкент改"
  | "Gambier Bay改"
  | "Intrepid改"
  | "伊168改"
  | "伊58改"
  | "伊8改"
  | "伊19改"
  | "まるゆ改"
  | "伊401改"
  | "雲龍"
  | "春雨"
  | "雲龍改"
  | "潮改二"
  | "隼鷹改二"
  | "早霜"
  | "清霜"
  | "扶桑改二"
  | "山城改二"
  | "朝雲"
  | "山雲"
  | "野分"
  | "古鷹改二"
  | "加古改二"
  | "皐月改二"
  | "初霜改二"
  | "叢雲改二"
  | "秋月"
  | "照月"
  | "初月"
  | "高波"
  | "朝霜"
  | "吹雪改二"
  | "鳥海改二"
  | "摩耶改二"
  | "天城改"
  | "葛城改"
  | "U-511"
  | "Graf Zeppelin"
  | "Saratoga"
  | "睦月改二"
  | "如月改二"
  | "呂500"
  | "暁改二"
  | "Saratoga改"
  | "Warspite"
  | "Iowa"
  | "Littorio"
  | "Roma"
  | "Libeccio"
  | "Aquila"
  | "秋津洲"
  | "Italia"
  | "Roma改"
  | "Zara"
  | "Pola"
  | "秋津洲改"
  | "瑞穂"
  | "沖波"
  | "風雲"
  | "嵐"
  | "萩風"
  | "親潮"
  | "山風"
  | "海風"
  | "江風"
  | "速吸"
  | "翔鶴改二"
  | "瑞鶴改二"
  | "朝潮改二"
  | "霞改二"
  | "鹿島"
  | "翔鶴改二甲"
  | "瑞鶴改二甲"
  | "朝潮改二丁"
  | "江風改二"
  | "霞改二乙"
  | "神風"
  | "朝風"
  | "春風"
  | "松風"
  | "旗風"
  | "神風改"
  | "天龍改二"
  | "龍田改二"
  | "天霧"
  | "狭霧"
  | "水無月"
  | "伊26"
  | "浜波"
  | "藤波"
  | "浦波"
  | "鬼怒改二"
  | "由良改二"
  | "満潮改二"
  | "荒潮改二"
  | "Commandant Teste"
  | "Richelieu"
  | "伊400"
  | "伊13"
  | "伊14"
  | "Zara due"
  | "白露改二"
  | "村雨改二"
  | "神威改"
  | "神威改母"
  | "鈴谷改二"
  | "熊野改二"
  | "鈴谷航改二"
  | "熊野航改二"
  | "Гангут"
  | "Октябрьская революция"
  | "Гангут два"
  | "Ark Royal"
  | "Ташкент"
  | "占守"
  | "国後"
  | "Jervis"
  | "Janus"
  | "春日丸"
  | "択捉"
  | "松輪"
  | "大鷹"
  | "岸波"
  | "早波"
  | "大鷹改二"
  | "伊504"
  | "佐渡"
  | "涼月"
  | "神鷹"
  | "Luigi Torelli"
  | "神鷹改二"
  | "涼月改"
  | "UIT-25"
  | "対馬"
  | "長門改二"
  | "夕雲改二"
  | "長波改二"
  | "Gambier Bay"
  | "Saratoga Mk.II"
  | "武蔵改二"
  | "多摩改二"
  | "文月改二"
  | "Intrepid"
  | "Saratoga Mk.II Mod.2"
  | "日振"
  | "大東"
  | "伊勢改二"
  | "日向改二"
  | "瑞鳳改二"
  | "浦風丁改"
  | "磯風乙改"
  | "浜風乙改"
  | "谷風丁改"
  | "瑞鳳改二乙"
  | "Samuel B.Roberts"
  | "Johnston"
  | "巻雲改二"
  | "風雲改二"
  | "福江"
  | "陽炎改二"
  | "不知火改二"
  | "黒潮改二"
  | "沖波改二"
  | "平戸"
  | "Nelson"
  | "陸奥改二"
  | "Gotland"
  | "Maestrale"
  | "Nelson改"
  | "朝霜改二"
  | "Gotland改"
  | "Maestrale改"
  | "日進"
  | "峯雲"
  | "八丈"
  | "石垣"
  | "日進甲"
  | "海風改二"
  | "L.d.S.D.d.Abruzzi"
  | "G.Garibaldi"
  | "金剛改二丙"
  | "比叡改二丙"
  | "赤城改二"
  | "Houston"
  | "Fletcher"
  | "Atlanta"
  | "赤城改二戊"
  | "Houston改"
  | "Colorado"
  | "South Dakota"
  | "Hornet"
  | "De Ruyter"
  | "Luigi Torelli改"
  | "伊400改"
  | "伊47改"
  | "De Ruyter改"
  | "加賀改二戊"
  | "御蔵"
  | "屋代"
  | "Perth"
  | "Grecale"
  | "Helena"
  | "御蔵改"
  | "屋代改"
  | "Perth改"
  | "Grecale改"
  | "Helena改"
  | "神州丸"
  | "夕張改二"
  | "夕張改二特"
  | "夕張改二丁"
  | "秋霜"
  | "神州丸改"
  | "敷波改二"
  | "Fletcher改 Mod.2"
  | "Fletcher Mk.II"
  | "Gotland andra"
  | "薄雲"
  | "有明"
  | "迅鯨"
  | "伊47"
  | "第四号海防艦"
  | "迅鯨改"
  | "松"
  | "加賀改二護"
  | "秋雲改二"
  | "日振改"
  | "大東改"
  | "浜波改"
  | "Samuel B.Roberts改"
  | "平戸改"
  | "福江改"
  | "岸波改"
  | "峯雲改"
  | "早波改"
  | "Johnston改"
  | "日進改"
  | "G.Garibaldi改"
  | "Fletcher改"
  | "L.d.S.D.d.Abruzzi改"
  | "秋霜改"
  | "Atlanta改"
  | "South Dakota改"
  | "加賀改二"
  | "薄雲改"
  | "第四号海防艦改"
  | "松改"
  | "有明改"
  | "Hornet改"
  | "Janus改"
  | "Colorado改"
  | "駆逐イ級"
  | "駆逐ロ級"
  | "駆逐ハ級"
  | "駆逐ニ級"
  | "軽巡ホ級"
  | "軽巡ヘ級"
  | "軽巡ト級"
  | "雷巡チ級"
  | "重巡リ級"
  | "軽母ヌ級"
  | "戦艦ル級"
  | "空母ヲ級"
  | "輸送ワ級"
  | "潜水カ級"
  | "潜水ヨ級"
  | "浮遊要塞"
  | "泊地棲鬼"
  | "泊地棲姫"
  | "戦艦タ級"
  | "装甲空母鬼"
  | "装甲空母姫"
  | "南方棲鬼"
  | "南方棲戦鬼"
  | "南方棲戦姫"
  | "護衛要塞"
  | "飛行場姫"
  | "戦艦棲姫"
  | "戦艦レ級"
  | "空母ヲ級改"
  | "重巡リ級改"
  | "戦艦ル級改"
  | "潜水ソ級"
  | "港湾棲姫"
  | "離島棲鬼"
  | "駆逐イ級後期型"
  | "駆逐ロ級後期型"
  | "駆逐ハ級後期型"
  | "駆逐ニ級後期型"
  | "北方棲姫"
  | "中間棲姫"
  | "空母棲鬼"
  | "空母棲姫"
  | "軽巡ツ級"
  | "重巡ネ級"
  | "駆逐棲姫"
  | "空母水鬼"
  | "軽巡棲鬼"
  | "戦艦水鬼"
  | "港湾水鬼"
  | "泊地水鬼"
  | "水母棲姫"
  | "防空棲姫"
  | "PT小鬼群"
  | "軽巡棲姫"
  | "潜水棲姫"
  | "駆逐水鬼"
  | "集積地棲姫"
  | "集積地棲姫-壊"
  | "重巡棲姫"
  | "砲台小鬼"
  | "離島棲姫"
  | "駆逐古鬼"
  | "リコリス棲姫"
  | "中枢棲姫"
  | "中枢棲姫-壊"
  | "駆逐古姫"
  | "潜水夏姫"
  | "戦艦夏姫"
  | "港湾夏姫"
  | "港湾夏姫-壊"
  | "重巡夏姫"
  | "水母水姫"
  | "深海海月姫"
  | "深海双子棲姫"
  | "深海双子棲姫-壊"
  | "護衛棲姫"
  | "北端上陸姫"
  | "北方水姫"
  | "北方水姫-壊"
  | "軽母ヌ級改"
  | "潜水新棲姫"
  | "駆逐ナ級"
  | "駆逐ナ級後期型"
  | "戦艦仏棲姫"
  | "戦艦仏棲姫-壊"
  | "空母夏鬼"
  | "空母夏姫"
  | "集積地夏姫"
  | "欧州棲姫"
  | "欧州棲姫-壊"
  | "海峡夜棲姫"
  | "海峡夜棲姫-壊"
  | "防空埋護姫"
  | "護衛棲水姫"
  | "護衛棲水姫-壊"
  | "戦艦棲姫改"
  | "戦艦水鬼改"
  | "戦艦水鬼改-壊"
  | "深海鶴棲姫"
  | "深海鶴棲姫-壊"
  | "潜水新棲姫 バカンスmode"
  | "集積地棲姫 バカンスmode"
  | "集積地棲姫 バカンスmode-壊"
  | "泊地水鬼 バカンスmode"
  | "護衛独還姫"
  | "護衛独還姫-壊"
  | "船渠棲姫"
  | "船渠棲姫-壊"
  | "戦艦仏棲姫 バカンスmode"
  | "戦艦仏棲姫-壊 バカンスmode"
  | "欧州水姫"
  | "欧州水姫-壊"
  | "深海雨雲姫"
  | "深海雨雲姫-壊"
  | "深海日棲姫"
  | "深海日棲姫-壊"
  | "駆逐ニ級改"
  | "駆逐ニ級改後期型"
  | "北方棲妹"
  | "北方棲妹-壊"
  | "太平洋深海棲姫"
  | "太平洋深海棲姫-壊"
  | "深海地中海棲姫"
  | "深海地中海棲姫-壊"
  | "アンツィオ沖棲姫"
  | "アンツィオ沖棲姫-壊"
  | "重巡ネ級改"
  | "バタビア沖棲姫"
  | "バタビア沖棲姫-壊"
  | "軽巡ヘ級改"
  | "空母棲姫改"
  | "防空巡棲姫"
  | "防空巡棲姫-壊"
  | "潜水棲姫改"
  | "潜水棲姫改-壊"
  | "集積地棲姫II"
  | "集積地棲姫II-壊"
  | "深海千島棲姫"
  | "深海千島棲姫-壊"
  | "集積地棲姫II 夏季上陸mode"
  | "集積地棲姫II 夏季上陸mode-壊"
  | "五島沖海底姫"
  | "五島沖海底姫-壊"
  | "駆逐林棲姫"
  | "駆逐林棲姫-壊"
  | "駆逐ナ級後期型II"
  | "重巡ネ級改 夏mode"
  | "重巡ネ級改II 夏mode"
  | "軽巡棲姫II"
  | "空母夏姫II"
  | "南方戦艦新棲姫"
  | "南方戦艦新棲姫-壊"
  | "南太平洋空母棲姫"
  | "南太平洋空母棲姫-壊"
  | "潜水夏姫II"

export type ShipYomi =
  | "むつき"
  | "きさらぎ"
  | "ながつき"
  | "みかづき"
  | "ふぶき"
  | "しらゆき"
  | "みゆき"
  | "いそなみ"
  | "あやなみ"
  | "しきなみ"
  | "あけぼの"
  | "うしお"
  | "かげろう"
  | "しらぬい"
  | "くろしお"
  | "ゆきかぜ"
  | "ながら"
  | "いすず"
  | "ゆら"
  | "おおい"
  | "きたかみ"
  | "ふそう"
  | "やましろ"
  | "さつき"
  | "ふみづき"
  | "きくづき"
  | "もちづき"
  | "はつゆき"
  | "むらくも"
  | "あかつき"
  | "ひびき"
  | "いかづち"
  | "いなづま"
  | "はつはる"
  | "ねのひ"
  | "わかば"
  | "はつしも"
  | "しらつゆ"
  | "しぐれ"
  | "むらさめ"
  | "ゆうだち"
  | "さみだれ"
  | "すずかぜ"
  | "あられ"
  | "かすみ"
  | "しまかぜ"
  | "てんりゅう"
  | "たつた"
  | "なとり"
  | "せんだい"
  | "じんつう"
  | "なか"
  | "ふるたか"
  | "かこ"
  | "あおば"
  | "みょうこう"
  | "なち"
  | "あしがら"
  | "はぐろ"
  | "たかお"
  | "あたご"
  | "まや"
  | "ちょうかい"
  | "もがみ"
  | "とね"
  | "ちくま"
  | "しょうほう"
  | "ひよう"
  | "りゅうじょう"
  | "いせ"
  | "こんごう"
  | "はるな"
  | "ながと"
  | "むつ"
  | "あかぎ"
  | "かが"
  | "きりしま"
  | "ひえい"
  | "ひゅうが"
  | "ほうしょう"
  | "そうりゅう"
  | "ひりゅう"
  | "じゅんよう"
  | "おぼろ"
  | "さざなみ"
  | "あさしお"
  | "おおしお"
  | "みちしお"
  | "あらしお"
  | "くま"
  | "たま"
  | "きそ"
  | "ちとせ"
  | "ちよだ"
  | "しょうかく"
  | "ずいかく"
  | "きぬ"
  | "あぶくま"
  | "ゆうばり"
  | "ずいほう"
  | "みくま"
  | "まいかぜ"
  | "きぬがさ"
  | "すずや"
  | "くまの"
  | "い168"
  | "い58"
  | "い8"
  | "やまと"
  | "あきぐも"
  | "ゆうぐも"
  | "まきぐも"
  | "ながなみ"
  | "あがの"
  | "のしろ"
  | "やはぎ"
  | "さかわ"
  | "むさし"
  | "たいほう"
  | "かとり"
  | "い401"
  | "あきつまる"
  | "かもい"
  | "まるゆ"
  | "やよい"
  | "うづき"
  | "いそかぜ"
  | "うらかぜ"
  | "たにかぜ"
  | "はまかぜ"
  | "ビスマルク"
  | "レーベレヒト・マース"
  | "マックス・シュルツ"
  | "プリンツ・オイゲン"
  | "あまつかぜ"
  | "あかし"
  | "おおよど"
  | "たいげい・りゅうほう"
  | "ときつかぜ"
  | "はつかぜ"
  | "い19"
  | "はるさめ"
  | "はやしも"
  | "きよしも"
  | "あさぐも"
  | "やまぐも"
  | "のわき"
  | "あきづき"
  | "あまぎ"
  | "かつらぎ"
  | "ゆー511・ろ500"
  | "あさしも"
  | "たかなみ"
  | "てるづき"
  | "リベッチオ"
  | "みずほ"
  | "かざぐも"
  | "うみかぜ"
  | "かわかぜ"
  | "はやすい"
  | "グラーフ・ツェッペリン"
  | "あらし"
  | "はぎかぜ"
  | "かしま"
  | "はつづき"
  | "ザラ"
  | "おきなみ"
  | "アイオワ"
  | "ポーラ"
  | "おやしお"
  | "はるかぜ"
  | "ウォースパイト"
  | "アクィラ"
  | "みなづき"
  | "い26"
  | "うらなみ"
  | "やまかぜ"
  | "あさかぜ"
  | "まつかぜ"
  | "コマンダン・テスト"
  | "ふじなみ"
  | "い13"
  | "い14"
  | "しむしゅ"
  | "くなしり"
  | "はちじょう"
  | "いしがき"
  | "たいよう"
  | "しんよう"
  | "えとろふ"
  | "まつわ"
  | "さど"
  | "つしま"
  | "はたかぜ"
  | "あまぎり"
  | "さぎり"
  | "リシュリュー"
  | "アークロイヤル"
  | "ジャーヴィス"
  | "タシュケント"
  | "ガンビア・ベイ"
  | "イントレピッド"
  | "うんりゅう"
  | "サラトガ"
  | "リットリオ・イタリア"
  | "ローマ"
  | "あきつしま"
  | "かみかぜ"
  | "はまなみ"
  | "い400"
  | "ガングート"
  | "ジェーナス"
  | "きしなみ"
  | "はやなみ"
  | "ルイージ・トレッリ"
  | "すずつき"
  | "ひぶり"
  | "だいとう"
  | "サミュエル・B・ロバーツ"
  | "ジョンストン"
  | "ふかえ"
  | "ひらと"
  | "ネルソン"
  | "ゴトランド"
  | "マエストラーレ"
  | "にっしん"
  | "みねぐも"
  | "アブルッツィ"
  | "ガリバルディ"
  | "ヒューストン"
  | "フレッチャー"
  | "アトランタ"
  | "コロラド"
  | "サウスダコタ"
  | "ホーネット"
  | "デ・ロイテル"
  | "い47"
  | "みくら"
  | "やしろ"
  | "パース"
  | "グレカーレ"
  | "ヘレナ"
  | "しんしゅうまる"
  | "あきしも"
  | "うすぐも"
  | "ありあけ"
  | "じんげい"
  | "だいよんごう"
  | "まつ"
  | "-"
  | "elite"
  | "flagship"
  | ""

export type ShipType =
  | "DE"
  | "DD"
  | "CL"
  | "CLT"
  | "CA"
  | "CAV"
  | "CVL"
  | "FBB"
  | "BB"
  | "BBV"
  | "CV"
  | "XBB"
  | "SS"
  | "SSV"
  | "AP"
  | "AV"
  | "LHA"
  | "CVB"
  | "AR"
  | "AS"
  | "CT"
  | "AO"

export type ShipClass =
  | "AyanamiClass"
  | "IseClass"
  | "KagaClass"
  | "KumaClass"
  | "AkatsukiClass"
  | "KongouClass"
  | "FurutakaClass"
  | "TakaoClass"
  | "MogamiClass"
  | "HatsuharuClass"
  | "ShouhouClass"
  | "FubukiClass"
  | "AobaClass"
  | "AkagiClass"
  | "ChitoseClass"
  | "SendaiClass"
  | "SouryuuClass"
  | "AsashioClass"
  | "NagatoClass"
  | "NagaraClass"
  | "TenryuuClass"
  | "ShimakazeClass"
  | "ShiratsuyuClass"
  | "HiyouClass"
  | "HiryuuClass"
  | "FusouClass"
  | "HoushouClass"
  | "MutsukiClass"
  | "MyoukouClass"
  | "KagerouClass"
  | "ToneClass"
  | "RyuujouClass"
  | "ShoukakuClass"
  | "YuubariClass"
  | "KaidaiVIClass"
  | "JunsenTypeBKai2"
  | "YamatoClass"
  | "YuugumoClass"
  | "JunsenTypeB"
  | "Junsen3Class"
  | "AganoClass"
  | "FleetOfFog"
  | "TaihouClass"
  | "I400Class"
  | "AkitsuMaruClass"
  | "Type3SubmergenceTransportVehicle"
  | "BismarckClass"
  | "Z1Class"
  | "RepairShip"
  | "TaigeiClass"
  | "RyuuhouClass"
  | "OoyodoClass"
  | "UnryuuClass"
  | "AkizukiClass"
  | "AdmiralHipperClass"
  | "KatoriClass"
  | "TypeIXCClass"
  | "VittorioVenetoClass"
  | "AkitsushimaClass"
  | "RevisedKazahayaClass"
  | "MaestraleClass"
  | "MizuhoClass"
  | "GrafZeppelinClass"
  | "ZaraClass"
  | "IowaClass"
  | "KamikazeClass"
  | "QueenElizabethClass"
  | "AquilaClass"
  | "LexingtonClass"
  | "CommandantTesteClass"
  | "JunsenTypeAKai2"
  | "KamoiClass"
  | "GangutClass"
  | "ShimushuClass"
  | "KasugaMaruClass"
  | "TaiyouClass"
  | "EtorofuClass"
  | "ArkRoyalClass"
  | "RichelieuClass"
  | "MarconiClass"
  | "TashkentClass"
  | "JClass"
  | "CasablancaClass"
  | "EssexClass"
  | "HiburiClass"
  | "RoSeries"
  | "JohnCButlerClass"
  | "NelsonClass"
  | "GotlandClass"
  | "NisshinClass"
  | "FletcherClass"
  | "DucaDegliAbruzziClass"
  | "ColoradoClass"
  | "MikuraClass"
  | "NorthamptonClass"
  | "PerthClass"
  | "R1"
  | "DeRuyterClass"
  | "AtlantaClass"
  | "JingeiClass"
  | "MatsuClass"
  | "SouthDakotaClass"
  | "JunsenTypeC"
  | "TypeDCoastalDefenseShip"
  | "YorktownClass"
  | "StLouisClass"
  | "DestroyerIClass"
  | "DestroyerRoClass"
  | "DestroyerHaClass"
  | "DestroyerNiClass"
  | "LightCruiserHoClass"
  | "LightCruiserHeClass"
  | "LightCruiserToClass"
  | "TorpedoCruiserChiClass"
  | "HeavyCruiserRiClass"
  | "LightCarrierNuClass"
  | "BattleshipRuClass"
  | "StandardCarrierWoClass"
  | "TransportShipWaClass"
  | "SubmarineKaClass"
  | "SubmarineYoClass"
  | "BattleshipTaClass"
  | "BattleshipReClass"
  | "SubmarineSoClass"
  | "LightCruiserTsuClass"
  | "HeavyCruiserNeClass"
  | "DestroyerNaClass"
  | "FloatingFortress"
  | "AnchorageDemon"
  | "AnchoragePrincess"
  | "ArmoredCarrierDemon"
  | "ArmoredCarrierPrincess"
  | "SouthernDemon"
  | "SouthernWarDemon"
  | "SouthernWarPrincess"
  | "EscortFortress"
  | "AirfieldPrincess"
  | "BattleshipPrincess"
  | "HarbourPrincess"
  | "IsolatedIslandDemon"
  | "NorthernPrincess"
  | "MidwayPrincess"
  | "AircraftCarrierDemon"
  | "AircraftCarrierPrincess"
  | "DestroyerPrincess"
  | "AircraftCarrierWaterDemon"
  | "LightCruiserDemon"
  | "BattleshipWaterDemon"
  | "HarbourWaterDemon"
  | "AnchorageWaterDemon"
  | "SeaplaneTenderPrincess"
  | "AirDefensePrincess"
  | "PTImpPack"
  | "LightCruiserPrincess"
  | "SubmarinePrincess"
  | "DestroyerWaterDemon"
  | "SupplyDepotPrincess"
  | "HeavyCruiserPrincess"
  | "ArtilleryImp"
  | "IsolatedIslandPrincess"
  | "AncientDestroyerDemon"
  | "LycorisPrincess"
  | "CentralPrincess"
  | "AncientDestroyerPrincess"
  | "SubmarineSummerPrincess"
  | "BattleshipSummerPrincess"
  | "HarbourSummerPrincess"
  | "HeavyCruiserSummerPrincess"
  | "SeaplaneTenderWaterPrincess"
  | "AbyssalJellyfishPrincess"
  | "AbyssalTwinPrincesses"
  | "EscortPrincess"
  | "NorthernmostLandingPrincess"
  | "NorthernWaterPrincess"
  | "NewSubmarinePrincess"
  | "FrenchBattleshipPrincess"
  | "AircraftCarrierSummerDemon"
  | "AircraftCarrierSummerPrincess"
  | "SupplyDepotSummerPrincess"
  | "EuropeanPrincess"
  | "NightStraitPrincesses"
  | "EntombedAntiAirGuardianPrincess"
  | "EscortWaterPrincess"
  | "AbyssalCranePrincess"
  | "GermanEscortPrincess"
  | "DockPrincess"
  | "EuropeanWaterPrincess"
  | "AbyssalNimbusPrincess"
  | "AbyssalSunPrincess"
  | "NorthernLittleSister"
  | "AbyssalPacificPrincess"
  | "AbyssalMediterraneanPrincess"
  | "AnzioPrincess"
  | "BataviaPrincess"
  | "AirDefenseCruiserPrincess"
  | "AbyssalKurilesPrincess"
  | "GotouIslandsSeabedPrincess"
  | "CoppiceDestroyerPrincess"

export type ShipAttribute = "NightCarrier" | "Installation" | "RoyalNavy" | "Kai2"

export const enum GearId {
  "12cm単装砲" = 1,
  "12.7cm連装砲" = 2,
  "10cm連装高角砲" = 3,
  "14cm単装砲" = 4,
  "15.5cm三連装砲" = 5,
  "20.3cm連装砲" = 6,
  "35.6cm連装砲" = 7,
  "41cm連装砲" = 8,
  "46cm三連装砲" = 9,
  "12.7cm連装高角砲" = 10,
  "15.2cm単装砲" = 11,
  "15.5cm三連装副砲" = 12,
  "61cm三連装魚雷" = 13,
  "61cm四連装魚雷" = 14,
  "61cm四連装(酸素)魚雷" = 15,
  "九七式艦攻" = 16,
  "天山" = 17,
  "流星" = 18,
  "九六式艦戦" = 19,
  "零式艦戦21型" = 20,
  "零式艦戦52型" = 21,
  "試製烈風 後期型" = 22,
  "九九式艦爆" = 23,
  "彗星" = 24,
  "零式水上偵察機" = 25,
  "瑞雲" = 26,
  "13号対空電探" = 27,
  "22号対水上電探" = 28,
  "33号対水上電探" = 29,
  "21号対空電探" = 30,
  "32号対水上電探" = 31,
  "42号対空電探" = 32,
  "改良型艦本式タービン" = 33,
  "強化型艦本式缶" = 34,
  "三式弾" = 35,
  "九一式徹甲弾" = 36,
  "7.7mm機銃" = 37,
  "12.7mm単装機銃" = 38,
  "25mm連装機銃" = 39,
  "25mm三連装機銃" = 40,
  "甲標的 甲型" = 41,
  "応急修理要員" = 42,
  "応急修理女神" = 43,
  "九四式爆雷投射機" = 44,
  "三式爆雷投射機" = 45,
  "九三式水中聴音機" = 46,
  "三式水中探信儀" = 47,
  "12cm単装高角砲" = 48,
  "25mm単装機銃" = 49,
  "20.3cm(3号)連装砲" = 50,
  "12cm30連装噴進砲" = 51,
  "流星改" = 52,
  "烈風 一一型" = 53,
  "彩雲" = 54,
  "紫電改二" = 55,
  "震電改" = 56,
  "彗星一二型甲" = 57,
  "61cm五連装(酸素)魚雷" = 58,
  "零式水上観測機" = 59,
  "零式艦戦62型(爆戦)" = 60,
  "二式艦上偵察機" = 61,
  "試製晴嵐" = 62,
  "12.7cm連装砲B型改二" = 63,
  "Ju87C改" = 64,
  "15.2cm連装砲" = 65,
  "8cm高角砲" = 66,
  "53cm艦首(酸素)魚雷" = 67,
  "大発動艇" = 68,
  "カ号観測機" = 69,
  "三式指揮連絡機(対潜)" = 70,
  "10cm連装高角砲(砲架)" = 71,
  "増設バルジ(中型艦)" = 72,
  "増設バルジ(大型艦)" = 73,
  "探照灯" = 74,
  "ドラム缶(輸送用)" = 75,
  "38cm連装砲" = 76,
  "15cm連装副砲" = 77,
  "12.7cm単装砲" = 78,
  "瑞雲(六三四空)" = 79,
  "瑞雲12型" = 80,
  "瑞雲12型(六三四空)" = 81,
  "九七式艦攻(九三一空)" = 82,
  "天山(九三一空)" = 83,
  "2cm 四連装FlaK 38" = 84,
  "3.7cm FlaK M42" = 85,
  "艦艇修理施設" = 86,
  "新型高温高圧缶" = 87,
  "22号対水上電探改四" = 88,
  "21号対空電探改" = 89,
  "20.3cm(2号)連装砲" = 90,
  "12.7cm連装高角砲(後期型)" = 91,
  "毘式40mm連装機銃" = 92,
  "九七式艦攻(友永隊)" = 93,
  "天山一二型(友永隊)" = 94,
  "潜水艦53cm艦首魚雷(8門)" = 95,
  "零式艦戦21型(熟練)" = 96,
  "九九式艦爆(熟練)" = 97,
  "九七式艦攻(熟練)" = 98,
  "九九式艦爆(江草隊)" = 99,
  "彗星(江草隊)" = 100,
  "照明弾" = 101,
  "九八式水上偵察機(夜偵)" = 102,
  "試製35.6cm三連装砲" = 103,
  "35.6cm連装砲(ダズル迷彩)" = 104,
  "試製41cm三連装砲" = 105,
  "13号対空電探改" = 106,
  "艦隊司令部施設" = 107,
  "熟練艦載機整備員" = 108,
  "零戦52型丙(六〇一空)" = 109,
  "烈風(六〇一空)" = 110,
  "彗星(六〇一空)" = 111,
  "天山(六〇一空)" = 112,
  "流星(六〇一空)" = 113,
  "38cm連装砲改" = 114,
  "Ar196改" = 115,
  "一式徹甲弾" = 116,
  "試製46cm連装砲" = 117,
  "紫雲" = 118,
  "14cm連装砲" = 119,
  "91式高射装置" = 120,
  "94式高射装置" = 121,
  "10cm連装高角砲+高射装置" = 122,
  "SKC34 20.3cm連装砲" = 123,
  "FuMO25 レーダー" = 124,
  "61cm三連装(酸素)魚雷" = 125,
  "WG42 (Wurfgerät 42)" = 126,
  "試製FaT仕様九五式酸素魚雷改" = 127,
  "試製51cm連装砲" = 128,
  "熟練見張員" = 129,
  "12.7cm高角砲+高射装置" = 130,
  "25mm三連装機銃 集中配備" = 131,
  "零式水中聴音機" = 132,
  "381mm/50 三連装砲" = 133,
  "OTO 152mm三連装速射砲" = 134,
  "90mm単装高角砲" = 135,
  "プリエーゼ式水中防御隔壁" = 136,
  "381mm/50 三連装砲改" = 137,
  "二式大艇" = 138,
  "15.2cm連装砲改" = 139,
  "96式150cm探照灯" = 140,
  "32号対水上電探改" = 141,
  "15m二重測距儀+21号電探改二" = 142,
  "九七式艦攻(村田隊)" = 143,
  "天山一二型(村田隊)" = 144,
  "戦闘糧食" = 145,
  "洋上補給" = 146,
  "120mm/50 連装砲" = 147,
  "試製南山" = 148,
  "四式水中聴音機" = 149,
  "秋刀魚の缶詰" = 150,
  "試製景雲(艦偵型)" = 151,
  "零式艦戦52型(熟練)" = 152,
  "零戦52型丙(付岩井小隊)" = 153,
  "零戦62型(爆戦/岩井隊)" = 154,
  "零戦21型(付岩本小隊)" = 155,
  "零戦52型甲(付岩本小隊)" = 156,
  "零式艦戦53型(岩本隊)" = 157,
  "Bf109T改" = 158,
  "Fw190T改" = 159,
  "10.5cm連装砲" = 160,
  "16inch三連装砲 Mk.7" = 161,
  "203mm/53 連装砲" = 162,
  "Ro.43水偵" = 163,
  "Ro.44水上戦闘機" = 164,
  "二式水戦改" = 165,
  "大発動艇(八九式中戦車&陸戦隊)" = 166,
  "特二式内火艇" = 167,
  "九六式陸攻" = 168,
  "一式陸攻" = 169,
  "一式陸攻(野中隊)" = 170,
  "OS2U" = 171,
  "5inch連装砲 Mk.28 mod.2" = 172,
  "Bofors 40mm四連装機関砲" = 173,
  "53cm連装魚雷" = 174,
  "雷電" = 175,
  "三式戦 飛燕" = 176,
  "三式戦 飛燕(飛行第244戦隊)" = 177,
  "PBY-5A Catalina" = 178,
  "試製61cm六連装(酸素)魚雷" = 179,
  "一式陸攻 二二型甲" = 180,
  "零式艦戦32型" = 181,
  "零式艦戦32型(熟練)" = 182,
  "16inch三連装砲 Mk.7+GFCS" = 183,
  "Re.2001 OR改" = 184,
  "三式戦 飛燕一型丁" = 185,
  "一式陸攻 三四型" = 186,
  "銀河" = 187,
  "Re.2001 G改" = 188,
  "Re.2005 改" = 189,
  "38.1cm Mk.I連装砲" = 190,
  "QF 2ポンド8連装ポンポン砲" = 191,
  "38.1cm Mk.I/N連装砲改" = 192,
  "特大発動艇" = 193,
  "Laté 298B" = 194,
  "SBD" = 195,
  "TBD" = 196,
  "F4F-3" = 197,
  "F4F-4" = 198,
  "噴式景雲改" = 199,
  "橘花改" = 200,
  "紫電一一型" = 201,
  "紫電二一型 紫電改" = 202,
  "艦本新設計 増設バルジ(中型艦)" = 203,
  "艦本新設計 増設バルジ(大型艦)" = 204,
  "F6F-3" = 205,
  "F6F-5" = 206,
  "瑞雲(六三一空)" = 207,
  "晴嵐(六三一空)" = 208,
  "彩雲(輸送用分解済)" = 209,
  "潜水艦搭載電探&水防式望遠鏡" = 210,
  "潜水艦搭載電探&逆探(E27)" = 211,
  "彩雲(東カロリン空)" = 212,
  "後期型艦首魚雷(6門)" = 213,
  "熟練聴音員+後期型艦首魚雷(6門)" = 214,
  "Ro.44水上戦闘機bis" = 215,
  "二式水戦改(熟練)" = 216,
  "強風改" = 217,
  "四式戦 疾風" = 218,
  "零式艦戦63型(爆戦)" = 219,
  "8cm高角砲改+増設機銃" = 220,
  "一式戦 隼II型" = 221,
  "一式戦 隼III型甲" = 222,
  "一式戦 隼III型甲(54戦隊)" = 223,
  "爆装一式戦 隼III型改(65戦隊)" = 224,
  "一式戦 隼II型(64戦隊)" = 225,
  "九五式爆雷" = 226,
  "二式爆雷" = 227,
  "九六式艦戦改" = 228,
  "12.7cm単装高角砲(後期型)" = 229,
  "特大発動艇+戦車第11連隊" = 230,
  "30.5cm三連装砲" = 231,
  "30.5cm三連装砲改" = 232,
  "F4U-1D" = 233,
  "15.5cm三連装副砲改" = 234,
  "15.5cm三連装砲改" = 235,
  "41cm三連装砲改" = 236,
  "瑞雲(六三四空/熟練)" = 237,
  "零式水上偵察機11型乙" = 238,
  "零式水上偵察機11型乙(熟練)" = 239,
  "22号対水上電探改四(後期調整型)" = 240,
  "戦闘糧食(特別なおにぎり)" = 241,
  "Swordfish" = 242,
  "Swordfish Mk.II(熟練)" = 243,
  "Swordfish Mk.III(熟練)" = 244,
  "38cm四連装砲" = 245,
  "38cm四連装砲改" = 246,
  "15.2cm三連装砲" = 247,
  "Skua" = 248,
  "Fulmar" = 249,
  "Spitfire Mk.I" = 250,
  "Spitfire Mk.V" = 251,
  "Seafire Mk.III改" = 252,
  "Spitfire Mk.IX(熟練)" = 253,
  "F6F-3N" = 254,
  "F6F-5N" = 255,
  "TBF" = 256,
  "TBM-3D" = 257,
  "夜間作戦航空要員" = 258,
  "夜間作戦航空要員+熟練甲板員" = 259,
  "Type124 ASDIC" = 260,
  "Type144/147 ASDIC" = 261,
  "HF/DF + Type144/147 ASDIC" = 262,
  "紫電改(三四三空) 戦闘301" = 263,
  "12.7cm連装砲C型改二" = 266,
  "12.7cm連装砲D型改二" = 267,
  "北方迷彩(+北方装備)" = 268,
  "試製東海" = 269,
  "東海(九〇一空)" = 270,
  "紫電改四" = 271,
  "遊撃部隊 艦隊司令部" = 272,
  "彩雲(偵四)" = 273,
  "12cm30連装噴進砲改二" = 274,
  "10cm連装高角砲改+増設機銃" = 275,
  "46cm三連装砲改" = 276,
  "FM-2" = 277,
  "SK レーダー" = 278,
  "SK+SG レーダー" = 279,
  "QF 4.7inch砲 Mk.XII改" = 280,
  "51cm連装砲" = 281,
  "130mm B-13連装砲" = 282,
  "533mm 三連装魚雷" = 283,
  "5inch単装砲 Mk.30" = 284,
  "61cm三連装(酸素)魚雷後期型" = 285,
  "61cm四連装(酸素)魚雷後期型" = 286,
  "三式爆雷投射機 集中配備" = 287,
  "試製15cm9連装対潜噴進砲" = 288,
  "35.6cm三連装砲改(ダズル迷彩仕様)" = 289,
  "41cm三連装砲改二" = 290,
  "彗星二二型(六三四空)" = 291,
  "彗星二二型(六三四空/熟練)" = 292,
  "12cm単装砲改二" = 293,
  "12.7cm連装砲A型改二" = 294,
  "12.7cm連装砲A型改三(戦時改修)+高射装置" = 295,
  "12.7cm連装砲B型改四(戦時改修)+高射装置" = 296,
  "12.7cm連装砲A型" = 297,
  "16inch Mk.I三連装砲" = 298,
  "16inch Mk.I三連装砲+AFCT改" = 299,
  "16inch Mk.I三連装砲改+FCR type284" = 300,
  "20連装7inch UP Rocket Launchers" = 301,
  "九七式艦攻(九三一空/熟練)" = 302,
  "Bofors 15.2cm連装砲 Model 1930" = 303,
  "S9 Osprey" = 304,
  "Ju87C改二(KMX搭載機)" = 305,
  "Ju87C改二(KMX搭載機/熟練)" = 306,
  "GFCS Mk.37" = 307,
  "5inch単装砲 Mk.30改+GFCS Mk.37" = 308,
  "甲標的 丙型" = 309,
  "14cm連装砲改" = 310,
  "二式陸上偵察機" = 311,
  "二式陸上偵察機(熟練)" = 312,
  "5inch単装砲 Mk.30改" = 313,
  "533mm五連装魚雷(初期型)" = 314,
  "SG レーダー(初期型)" = 315,
  "Re.2001 CB改" = 316,
  "三式弾改" = 317,
  "41cm連装砲改二" = 318,
  "彗星一二型(六三四空/三号爆弾搭載機)" = 319,
  "彗星一二型(三一号光電管爆弾搭載機)" = 320,
  "瑞雲改二(六三四空)" = 322,
  "瑞雲改二(六三四空/熟練)" = 323,
  "オ号観測機改" = 324,
  "オ号観測機改二" = 325,
  "S-51J" = 326,
  "S-51J改" = 327,
  "35.6cm連装砲改" = 328,
  "35.6cm連装砲改二" = 329,
  "16inch Mk.I連装砲" = 330,
  "16inch Mk.V連装砲" = 331,
  "16inch Mk.VIII連装砲改" = 332,
  "烈風改" = 333,
  "烈風改(三五二空/熟練)" = 334,
  "烈風改(試製艦載型)" = 335,
  "烈風改二" = 336,
  "烈風改二(一航戦/熟練)" = 337,
  "烈風改二戊型" = 338,
  "烈風改二戊型(一航戦/熟練)" = 339,
  "152mm/55 三連装速射砲" = 340,
  "152mm/55 三連装速射砲改" = 341,
  "流星改(一航戦)" = 342,
  "流星改(一航戦/熟練)" = 343,
  "九七式艦攻改 試製三号戊型(空六号電探改装備機)" = 344,
  "九七式艦攻改(熟練) 試製三号戊型(空六号電探改装備機)" = 345,
  "二式12cm迫撃砲改" = 346,
  "二式12cm迫撃砲改 集中配備" = 347,
  "艦載型 四式20cm対地噴進砲" = 348,
  "四式20cm対地噴進砲 集中配備" = 349,
  "Me163B" = 350,
  "試製 秋水" = 351,
  "秋水" = 352,
  "Fw190 A-5改(熟練)" = 353,
  "Fw190 D-9" = 354,
  "M4A1 DD" = 355,
  "8inch三連装砲 Mk.9" = 356,
  "8inch三連装砲 Mk.9 mod.2" = 357,
  "5inch 単装高角砲群" = 358,
  "6inch 連装速射砲 Mk.XXI" = 359,
  "Bofors 15cm連装速射砲 Mk.9 Model 1938" = 360,
  "Bofors 15cm連装速射砲 Mk.9改+単装速射砲 Mk.10改 Model 1938" = 361,
  "5inch連装両用砲(集中配備)" = 362,
  "GFCS Mk.37+5inch連装両用砲(集中配備)" = 363,
  "甲標的 丁型改(蛟龍改)" = 364,
  "一式徹甲弾改" = 365,
  "12.7cm連装砲D型改三" = 366,
  "Swordfish(水上機型)" = 367,
  "Swordfish Mk.III改(水上機型)" = 368,
  "Swordfish Mk.III改(水上機型/熟練)" = 369,
  "Swordfish Mk.II改(水偵型)" = 370,
  "Fairey Seafox改" = 371,
  "天山一二型甲" = 372,
  "天山一二型甲改(空六号電探改装備機)" = 373,
  "天山一二型甲改(熟練/空六号電探改装備機)" = 374,
  "XF5U" = 375,
  "533mm五連装魚雷(後期型)" = 376,
  "RUR-4A Weapon Alpha改" = 377,
  "対潜短魚雷(試作初期型)" = 378,
  "12.7cm単装高角砲改二" = 379,
  "12.7cm連装高角砲改二" = 380,
  "16inch三連装砲 Mk.6" = 381,
  "12cm単装高角砲E型" = 382,
  "後期型53cm艦首魚雷(8門)" = 383,
  "後期型潜水艦搭載電探&逆探" = 384,
  "16inch三連装砲 Mk.6 mod.2" = 385,
  "6inch三連装速射砲 Mk.16" = 386,
  "6inch三連装速射砲 Mk.16 mod.2" = 387,
  "銀河(江草隊)" = 388,
  "TBM-3W+3S" = 389,
  "16inch三連装砲 Mk.6+GFCS" = 390,
  "九九式艦爆二二型" = 391,
  "九九式艦爆二二型(熟練)" = 392,
  "120mm/50 連装砲 mod.1936" = 393,
  "120mm/50 連装砲改 A.mod.1937" = 394,
  "深山" = 395,
  "深山改" = 396,
  "5inch単装砲" = 501,
  "5inch連装砲" = 502,
  "3inch単装高角砲" = 503,
  "5inch単装高射砲 id504" = 504,
  "8inch三連装砲" = 505,
  "6inch連装速射砲" = 506,
  "14inch連装砲" = 507,
  "16inch連装砲" = 508,
  "16inch三連装砲 id509" = 509,
  "5inch単装高射砲 id510" = 510,
  "6inch単装砲" = 511,
  "12.5inch連装副砲" = 512,
  "21inch魚雷前期型" = 513,
  "21inch魚雷後期型" = 514,
  "高速深海魚雷" = 515,
  "深海棲艦攻" = 516,
  "深海棲艦攻 Mark.II" = 517,
  "深海棲艦攻 Mark.III" = 518,
  "深海棲艦戦" = 519,
  "深海棲艦戦 Mark.II" = 520,
  "深海棲艦戦 Mark.III" = 521,
  "飛び魚艦戦" = 522,
  "深海棲艦爆" = 523,
  "深海棲艦爆 Mark.II" = 524,
  "深海棲艦偵察機" = 525,
  "飛び魚偵察機" = 526,
  "対空レーダ― Mark.I" = 527,
  "水上レーダ― Mark.I" = 528,
  "水上レーダ― Mark.II" = 529,
  "対空レーダ― Mark.II" = 530,
  "深海水上レーダー" = 531,
  "深海対空レーダ―" = 532,
  "改良型深海タービン" = 533,
  "強化型深海缶" = 534,
  "対空散弾" = 535,
  "劣化徹甲弾" = 536,
  "12.7mm機銃" = 537,
  "20mm機銃" = 538,
  "40mm二連装機関砲" = 539,
  "40mm四連装機関砲" = 540,
  "深海烏賊魚雷" = 541,
  "深海爆雷投射機" = 542,
  "深海ソナー" = 543,
  "深海爆雷投射機 Mk.II" = 544,
  "深海ソナー Mk.II" = 545,
  "飛び魚艦爆" = 546,
  "深海猫艦戦" = 547,
  "深海地獄艦爆" = 548,
  "深海復讐艦攻" = 549,
  "5inch連装両用莢砲" = 550,
  "20inch連装砲" = 551,
  "15inch要塞砲" = 552,
  "4inch連装両用砲+CIC" = 553,
  "深海水上攻撃機" = 554,
  "深海水上攻撃機改" = 555,
  "深海猫艦戦改" = 556,
  "深海地獄艦爆改" = 557,
  "深海復讐艦攻改" = 558,
  "深海FCS+CIC" = 559,
  "深海探照灯" = 560,
  "深海解放陸爆" = 561,
  "深海解放陸爆Ace" = 562,
  "8inch長射程連装砲" = 563,
  "深海水上偵察観測機" = 564,
  "5inch沿岸設置砲" = 565,
  "深海猫艦戦(爆装)" = 566,
  "沿岸設置レーダー" = 567,
  "16inch三連装砲 id568" = 568,
  "深海偵察飛行艇" = 569,
  "高速深海魚雷 mod.2" = 570,
  "深海水母小鬼機" = 571,
  "深海熊猫艦戦" = 572,
  "深海潜水下駄履き" = 573,
  "深海攻撃哨戒鷹" = 574,
  "深海攻撃哨戒鷹改" = 575,
  "深海12inch三連装砲" = 576,
  "深海15inch四連装砲" = 577,
  "深海15inch連装砲後期型" = 578,
  "深海14inch海峡連装砲" = 579,
  "深海待伏魚雷" = 580,
  "夜猫深海艦戦" = 581,
  "夜深海艦爆" = 582,
  "夜復讐深海艦攻" = 583,
  "深海14inch連装砲改" = 584,
  "深海16inch三連装砲改" = 585,
  "深海攻撃哨戒鷹改二" = 586,
  "深海16inch三連装砲改二" = 587,
  "深海5inch連装砲C型" = 588,
  "深海5.5inch連装砲改" = 589,
  "深海標的" = 590,
  "深海5inch単装砲 Mk.30" = 591,
  "深海16inch Mk.VIII連装砲改" = 592,
  "高速深海魚雷 mod.3" = 593,
  "深海空要塞(偵察型)" = 594,
  "深海空要塞Ace(偵察型)" = 595,
  "深海6inch三連装新型速射砲" = 596,
  "深海空要塞(重爆型)" = 597,
  "深海空要塞Ace(重爆型)" = 598,
  "深海4.7inch砲 Mk.XII" = 599,
  "深海8inch連装速射砲" = 600,
  "深海8inch三連装砲 Mk.9" = 601,
  "深海5inch連装両用砲(集中配備)" = 602,
  "深海対空レーダーMark.III+FCS" = 603,
  "深海5inch連装砲A型" = 604,
  "深海潜水艦搭載電子兵装" = 605,
  "深海5inch単装高角砲改二" = 606,
  "深海5inch連装高角砲改二" = 607,
  "深海夜間航空作戦装備" = 608,
  "深海16inch三連装砲 Mk6" = 609,
}

export type GearName =
  | "12cm単装砲"
  | "12.7cm連装砲"
  | "10cm連装高角砲"
  | "14cm単装砲"
  | "15.5cm三連装砲"
  | "20.3cm連装砲"
  | "35.6cm連装砲"
  | "41cm連装砲"
  | "46cm三連装砲"
  | "12.7cm連装高角砲"
  | "15.2cm単装砲"
  | "15.5cm三連装副砲"
  | "61cm三連装魚雷"
  | "61cm四連装魚雷"
  | "61cm四連装(酸素)魚雷"
  | "九七式艦攻"
  | "天山"
  | "流星"
  | "九六式艦戦"
  | "零式艦戦21型"
  | "零式艦戦52型"
  | "試製烈風 後期型"
  | "九九式艦爆"
  | "彗星"
  | "零式水上偵察機"
  | "瑞雲"
  | "13号対空電探"
  | "22号対水上電探"
  | "33号対水上電探"
  | "21号対空電探"
  | "32号対水上電探"
  | "42号対空電探"
  | "改良型艦本式タービン"
  | "強化型艦本式缶"
  | "三式弾"
  | "九一式徹甲弾"
  | "7.7mm機銃"
  | "12.7mm単装機銃"
  | "25mm連装機銃"
  | "25mm三連装機銃"
  | "甲標的 甲型"
  | "応急修理要員"
  | "応急修理女神"
  | "九四式爆雷投射機"
  | "三式爆雷投射機"
  | "九三式水中聴音機"
  | "三式水中探信儀"
  | "12cm単装高角砲"
  | "25mm単装機銃"
  | "20.3cm(3号)連装砲"
  | "12cm30連装噴進砲"
  | "流星改"
  | "烈風 一一型"
  | "彩雲"
  | "紫電改二"
  | "震電改"
  | "彗星一二型甲"
  | "61cm五連装(酸素)魚雷"
  | "零式水上観測機"
  | "零式艦戦62型(爆戦)"
  | "二式艦上偵察機"
  | "試製晴嵐"
  | "12.7cm連装砲B型改二"
  | "Ju87C改"
  | "15.2cm連装砲"
  | "8cm高角砲"
  | "53cm艦首(酸素)魚雷"
  | "大発動艇"
  | "カ号観測機"
  | "三式指揮連絡機(対潜)"
  | "10cm連装高角砲(砲架)"
  | "増設バルジ(中型艦)"
  | "増設バルジ(大型艦)"
  | "探照灯"
  | "ドラム缶(輸送用)"
  | "38cm連装砲"
  | "15cm連装副砲"
  | "12.7cm単装砲"
  | "瑞雲(六三四空)"
  | "瑞雲12型"
  | "瑞雲12型(六三四空)"
  | "九七式艦攻(九三一空)"
  | "天山(九三一空)"
  | "2cm 四連装FlaK 38"
  | "3.7cm FlaK M42"
  | "艦艇修理施設"
  | "新型高温高圧缶"
  | "22号対水上電探改四"
  | "21号対空電探改"
  | "20.3cm(2号)連装砲"
  | "12.7cm連装高角砲(後期型)"
  | "毘式40mm連装機銃"
  | "九七式艦攻(友永隊)"
  | "天山一二型(友永隊)"
  | "潜水艦53cm艦首魚雷(8門)"
  | "零式艦戦21型(熟練)"
  | "九九式艦爆(熟練)"
  | "九七式艦攻(熟練)"
  | "九九式艦爆(江草隊)"
  | "彗星(江草隊)"
  | "照明弾"
  | "九八式水上偵察機(夜偵)"
  | "試製35.6cm三連装砲"
  | "35.6cm連装砲(ダズル迷彩)"
  | "試製41cm三連装砲"
  | "13号対空電探改"
  | "艦隊司令部施設"
  | "熟練艦載機整備員"
  | "零戦52型丙(六〇一空)"
  | "烈風(六〇一空)"
  | "彗星(六〇一空)"
  | "天山(六〇一空)"
  | "流星(六〇一空)"
  | "38cm連装砲改"
  | "Ar196改"
  | "一式徹甲弾"
  | "試製46cm連装砲"
  | "紫雲"
  | "14cm連装砲"
  | "91式高射装置"
  | "94式高射装置"
  | "10cm連装高角砲+高射装置"
  | "SKC34 20.3cm連装砲"
  | "FuMO25 レーダー"
  | "61cm三連装(酸素)魚雷"
  | "WG42 (Wurfgerät 42)"
  | "試製FaT仕様九五式酸素魚雷改"
  | "試製51cm連装砲"
  | "熟練見張員"
  | "12.7cm高角砲+高射装置"
  | "25mm三連装機銃 集中配備"
  | "零式水中聴音機"
  | "381mm/50 三連装砲"
  | "OTO 152mm三連装速射砲"
  | "90mm単装高角砲"
  | "プリエーゼ式水中防御隔壁"
  | "381mm/50 三連装砲改"
  | "二式大艇"
  | "15.2cm連装砲改"
  | "96式150cm探照灯"
  | "32号対水上電探改"
  | "15m二重測距儀+21号電探改二"
  | "九七式艦攻(村田隊)"
  | "天山一二型(村田隊)"
  | "戦闘糧食"
  | "洋上補給"
  | "120mm/50 連装砲"
  | "試製南山"
  | "四式水中聴音機"
  | "秋刀魚の缶詰"
  | "試製景雲(艦偵型)"
  | "零式艦戦52型(熟練)"
  | "零戦52型丙(付岩井小隊)"
  | "零戦62型(爆戦/岩井隊)"
  | "零戦21型(付岩本小隊)"
  | "零戦52型甲(付岩本小隊)"
  | "零式艦戦53型(岩本隊)"
  | "Bf109T改"
  | "Fw190T改"
  | "10.5cm連装砲"
  | "16inch三連装砲 Mk.7"
  | "203mm/53 連装砲"
  | "Ro.43水偵"
  | "Ro.44水上戦闘機"
  | "二式水戦改"
  | "大発動艇(八九式中戦車&陸戦隊)"
  | "特二式内火艇"
  | "九六式陸攻"
  | "一式陸攻"
  | "一式陸攻(野中隊)"
  | "OS2U"
  | "5inch連装砲 Mk.28 mod.2"
  | "Bofors 40mm四連装機関砲"
  | "53cm連装魚雷"
  | "雷電"
  | "三式戦 飛燕"
  | "三式戦 飛燕(飛行第244戦隊)"
  | "PBY-5A Catalina"
  | "試製61cm六連装(酸素)魚雷"
  | "一式陸攻 二二型甲"
  | "零式艦戦32型"
  | "零式艦戦32型(熟練)"
  | "16inch三連装砲 Mk.7+GFCS"
  | "Re.2001 OR改"
  | "三式戦 飛燕一型丁"
  | "一式陸攻 三四型"
  | "銀河"
  | "Re.2001 G改"
  | "Re.2005 改"
  | "38.1cm Mk.I連装砲"
  | "QF 2ポンド8連装ポンポン砲"
  | "38.1cm Mk.I/N連装砲改"
  | "特大発動艇"
  | "Laté 298B"
  | "SBD"
  | "TBD"
  | "F4F-3"
  | "F4F-4"
  | "噴式景雲改"
  | "橘花改"
  | "紫電一一型"
  | "紫電二一型 紫電改"
  | "艦本新設計 増設バルジ(中型艦)"
  | "艦本新設計 増設バルジ(大型艦)"
  | "F6F-3"
  | "F6F-5"
  | "瑞雲(六三一空)"
  | "晴嵐(六三一空)"
  | "彩雲(輸送用分解済)"
  | "潜水艦搭載電探&水防式望遠鏡"
  | "潜水艦搭載電探&逆探(E27)"
  | "彩雲(東カロリン空)"
  | "後期型艦首魚雷(6門)"
  | "熟練聴音員+後期型艦首魚雷(6門)"
  | "Ro.44水上戦闘機bis"
  | "二式水戦改(熟練)"
  | "強風改"
  | "四式戦 疾風"
  | "零式艦戦63型(爆戦)"
  | "8cm高角砲改+増設機銃"
  | "一式戦 隼II型"
  | "一式戦 隼III型甲"
  | "一式戦 隼III型甲(54戦隊)"
  | "爆装一式戦 隼III型改(65戦隊)"
  | "一式戦 隼II型(64戦隊)"
  | "九五式爆雷"
  | "二式爆雷"
  | "九六式艦戦改"
  | "12.7cm単装高角砲(後期型)"
  | "特大発動艇+戦車第11連隊"
  | "30.5cm三連装砲"
  | "30.5cm三連装砲改"
  | "F4U-1D"
  | "15.5cm三連装副砲改"
  | "15.5cm三連装砲改"
  | "41cm三連装砲改"
  | "瑞雲(六三四空/熟練)"
  | "零式水上偵察機11型乙"
  | "零式水上偵察機11型乙(熟練)"
  | "22号対水上電探改四(後期調整型)"
  | "戦闘糧食(特別なおにぎり)"
  | "Swordfish"
  | "Swordfish Mk.II(熟練)"
  | "Swordfish Mk.III(熟練)"
  | "38cm四連装砲"
  | "38cm四連装砲改"
  | "15.2cm三連装砲"
  | "Skua"
  | "Fulmar"
  | "Spitfire Mk.I"
  | "Spitfire Mk.V"
  | "Seafire Mk.III改"
  | "Spitfire Mk.IX(熟練)"
  | "F6F-3N"
  | "F6F-5N"
  | "TBF"
  | "TBM-3D"
  | "夜間作戦航空要員"
  | "夜間作戦航空要員+熟練甲板員"
  | "Type124 ASDIC"
  | "Type144/147 ASDIC"
  | "HF/DF + Type144/147 ASDIC"
  | "紫電改(三四三空) 戦闘301"
  | "12.7cm連装砲C型改二"
  | "12.7cm連装砲D型改二"
  | "北方迷彩(+北方装備)"
  | "試製東海"
  | "東海(九〇一空)"
  | "紫電改四"
  | "遊撃部隊 艦隊司令部"
  | "彩雲(偵四)"
  | "12cm30連装噴進砲改二"
  | "10cm連装高角砲改+増設機銃"
  | "46cm三連装砲改"
  | "FM-2"
  | "SK レーダー"
  | "SK+SG レーダー"
  | "QF 4.7inch砲 Mk.XII改"
  | "51cm連装砲"
  | "130mm B-13連装砲"
  | "533mm 三連装魚雷"
  | "5inch単装砲 Mk.30"
  | "61cm三連装(酸素)魚雷後期型"
  | "61cm四連装(酸素)魚雷後期型"
  | "三式爆雷投射機 集中配備"
  | "試製15cm9連装対潜噴進砲"
  | "35.6cm三連装砲改(ダズル迷彩仕様)"
  | "41cm三連装砲改二"
  | "彗星二二型(六三四空)"
  | "彗星二二型(六三四空/熟練)"
  | "12cm単装砲改二"
  | "12.7cm連装砲A型改二"
  | "12.7cm連装砲A型改三(戦時改修)+高射装置"
  | "12.7cm連装砲B型改四(戦時改修)+高射装置"
  | "12.7cm連装砲A型"
  | "16inch Mk.I三連装砲"
  | "16inch Mk.I三連装砲+AFCT改"
  | "16inch Mk.I三連装砲改+FCR type284"
  | "20連装7inch UP Rocket Launchers"
  | "九七式艦攻(九三一空/熟練)"
  | "Bofors 15.2cm連装砲 Model 1930"
  | "S9 Osprey"
  | "Ju87C改二(KMX搭載機)"
  | "Ju87C改二(KMX搭載機/熟練)"
  | "GFCS Mk.37"
  | "5inch単装砲 Mk.30改+GFCS Mk.37"
  | "甲標的 丙型"
  | "14cm連装砲改"
  | "二式陸上偵察機"
  | "二式陸上偵察機(熟練)"
  | "5inch単装砲 Mk.30改"
  | "533mm五連装魚雷(初期型)"
  | "SG レーダー(初期型)"
  | "Re.2001 CB改"
  | "三式弾改"
  | "41cm連装砲改二"
  | "彗星一二型(六三四空/三号爆弾搭載機)"
  | "彗星一二型(三一号光電管爆弾搭載機)"
  | "瑞雲改二(六三四空)"
  | "瑞雲改二(六三四空/熟練)"
  | "オ号観測機改"
  | "オ号観測機改二"
  | "S-51J"
  | "S-51J改"
  | "35.6cm連装砲改"
  | "35.6cm連装砲改二"
  | "16inch Mk.I連装砲"
  | "16inch Mk.V連装砲"
  | "16inch Mk.VIII連装砲改"
  | "烈風改"
  | "烈風改(三五二空/熟練)"
  | "烈風改(試製艦載型)"
  | "烈風改二"
  | "烈風改二(一航戦/熟練)"
  | "烈風改二戊型"
  | "烈風改二戊型(一航戦/熟練)"
  | "152mm/55 三連装速射砲"
  | "152mm/55 三連装速射砲改"
  | "流星改(一航戦)"
  | "流星改(一航戦/熟練)"
  | "九七式艦攻改 試製三号戊型(空六号電探改装備機)"
  | "九七式艦攻改(熟練) 試製三号戊型(空六号電探改装備機)"
  | "二式12cm迫撃砲改"
  | "二式12cm迫撃砲改 集中配備"
  | "艦載型 四式20cm対地噴進砲"
  | "四式20cm対地噴進砲 集中配備"
  | "Me163B"
  | "試製 秋水"
  | "秋水"
  | "Fw190 A-5改(熟練)"
  | "Fw190 D-9"
  | "M4A1 DD"
  | "8inch三連装砲 Mk.9"
  | "8inch三連装砲 Mk.9 mod.2"
  | "5inch 単装高角砲群"
  | "6inch 連装速射砲 Mk.XXI"
  | "Bofors 15cm連装速射砲 Mk.9 Model 1938"
  | "Bofors 15cm連装速射砲 Mk.9改+単装速射砲 Mk.10改 Model 1938"
  | "5inch連装両用砲(集中配備)"
  | "GFCS Mk.37+5inch連装両用砲(集中配備)"
  | "甲標的 丁型改(蛟龍改)"
  | "一式徹甲弾改"
  | "12.7cm連装砲D型改三"
  | "Swordfish(水上機型)"
  | "Swordfish Mk.III改(水上機型)"
  | "Swordfish Mk.III改(水上機型/熟練)"
  | "Swordfish Mk.II改(水偵型)"
  | "Fairey Seafox改"
  | "天山一二型甲"
  | "天山一二型甲改(空六号電探改装備機)"
  | "天山一二型甲改(熟練/空六号電探改装備機)"
  | "XF5U"
  | "533mm五連装魚雷(後期型)"
  | "RUR-4A Weapon Alpha改"
  | "対潜短魚雷(試作初期型)"
  | "12.7cm単装高角砲改二"
  | "12.7cm連装高角砲改二"
  | "16inch三連装砲 Mk.6"
  | "12cm単装高角砲E型"
  | "後期型53cm艦首魚雷(8門)"
  | "後期型潜水艦搭載電探&逆探"
  | "16inch三連装砲 Mk.6 mod.2"
  | "6inch三連装速射砲 Mk.16"
  | "6inch三連装速射砲 Mk.16 mod.2"
  | "銀河(江草隊)"
  | "TBM-3W+3S"
  | "16inch三連装砲 Mk.6+GFCS"
  | "九九式艦爆二二型"
  | "九九式艦爆二二型(熟練)"
  | "120mm/50 連装砲 mod.1936"
  | "120mm/50 連装砲改 A.mod.1937"
  | "深山"
  | "深山改"
  | "5inch単装砲"
  | "5inch連装砲"
  | "3inch単装高角砲"
  | "5inch単装高射砲"
  | "8inch三連装砲"
  | "6inch連装速射砲"
  | "14inch連装砲"
  | "16inch連装砲"
  | "16inch三連装砲"
  | "6inch単装砲"
  | "12.5inch連装副砲"
  | "21inch魚雷前期型"
  | "21inch魚雷後期型"
  | "高速深海魚雷"
  | "深海棲艦攻"
  | "深海棲艦攻 Mark.II"
  | "深海棲艦攻 Mark.III"
  | "深海棲艦戦"
  | "深海棲艦戦 Mark.II"
  | "深海棲艦戦 Mark.III"
  | "飛び魚艦戦"
  | "深海棲艦爆"
  | "深海棲艦爆 Mark.II"
  | "深海棲艦偵察機"
  | "飛び魚偵察機"
  | "対空レーダ― Mark.I"
  | "水上レーダ― Mark.I"
  | "水上レーダ― Mark.II"
  | "対空レーダ― Mark.II"
  | "深海水上レーダー"
  | "深海対空レーダ―"
  | "改良型深海タービン"
  | "強化型深海缶"
  | "対空散弾"
  | "劣化徹甲弾"
  | "12.7mm機銃"
  | "20mm機銃"
  | "40mm二連装機関砲"
  | "40mm四連装機関砲"
  | "深海烏賊魚雷"
  | "深海爆雷投射機"
  | "深海ソナー"
  | "深海爆雷投射機 Mk.II"
  | "深海ソナー Mk.II"
  | "飛び魚艦爆"
  | "深海猫艦戦"
  | "深海地獄艦爆"
  | "深海復讐艦攻"
  | "5inch連装両用莢砲"
  | "20inch連装砲"
  | "15inch要塞砲"
  | "4inch連装両用砲+CIC"
  | "深海水上攻撃機"
  | "深海水上攻撃機改"
  | "深海猫艦戦改"
  | "深海地獄艦爆改"
  | "深海復讐艦攻改"
  | "深海FCS+CIC"
  | "深海探照灯"
  | "深海解放陸爆"
  | "深海解放陸爆Ace"
  | "8inch長射程連装砲"
  | "深海水上偵察観測機"
  | "5inch沿岸設置砲"
  | "深海猫艦戦(爆装)"
  | "沿岸設置レーダー"
  | "深海偵察飛行艇"
  | "高速深海魚雷 mod.2"
  | "深海水母小鬼機"
  | "深海熊猫艦戦"
  | "深海潜水下駄履き"
  | "深海攻撃哨戒鷹"
  | "深海攻撃哨戒鷹改"
  | "深海12inch三連装砲"
  | "深海15inch四連装砲"
  | "深海15inch連装砲後期型"
  | "深海14inch海峡連装砲"
  | "深海待伏魚雷"
  | "夜猫深海艦戦"
  | "夜深海艦爆"
  | "夜復讐深海艦攻"
  | "深海14inch連装砲改"
  | "深海16inch三連装砲改"
  | "深海攻撃哨戒鷹改二"
  | "深海16inch三連装砲改二"
  | "深海5inch連装砲C型"
  | "深海5.5inch連装砲改"
  | "深海標的"
  | "深海5inch単装砲 Mk.30"
  | "深海16inch Mk.VIII連装砲改"
  | "高速深海魚雷 mod.3"
  | "深海空要塞(偵察型)"
  | "深海空要塞Ace(偵察型)"
  | "深海6inch三連装新型速射砲"
  | "深海空要塞(重爆型)"
  | "深海空要塞Ace(重爆型)"
  | "深海4.7inch砲 Mk.XII"
  | "深海8inch連装速射砲"
  | "深海8inch三連装砲 Mk.9"
  | "深海5inch連装両用砲(集中配備)"
  | "深海対空レーダーMark.III+FCS"
  | "深海5inch連装砲A型"
  | "深海潜水艦搭載電子兵装"
  | "深海5inch単装高角砲改二"
  | "深海5inch連装高角砲改二"
  | "深海夜間航空作戦装備"
  | "深海16inch三連装砲 Mk6"

export type GearCategory =
  | "SmallCaliberMainGun"
  | "MediumCaliberMainGun"
  | "LargeCaliberMainGun"
  | "SecondaryGun"
  | "Torpedo"
  | "CbFighter"
  | "CbDiveBomber"
  | "CbTorpedoBomber"
  | "CbRecon"
  | "ReconSeaplane"
  | "SeaplaneBomber"
  | "SmallRadar"
  | "LargeRadar"
  | "Sonar"
  | "DepthCharge"
  | "ExtraArmor"
  | "EngineImprovement"
  | "AntiAirShell"
  | "ApShell"
  | "VtFuze"
  | "AntiAirGun"
  | "MidgetSubmarine"
  | "EmergencyRepairPersonnel"
  | "LandingCraft"
  | "Autogyro"
  | "AntiSubPatrolAircraft"
  | "MediumExtraArmor"
  | "LargeExtraArmor"
  | "Searchlight"
  | "SupplyTransportContainer"
  | "ShipRepairFacility"
  | "SubmarineTorpedo"
  | "Starshell"
  | "CommandFacility"
  | "AviationPersonnel"
  | "AntiAirFireDirector"
  | "AntiGroundEquipment"
  | "LargeCaliberMainGun2"
  | "SurfaceShipPersonnel"
  | "LargeSonar"
  | "LargeFlyingBoat"
  | "LargeSearchlight"
  | "CombatRation"
  | "Supplies"
  | "SeaplaneFighter"
  | "SpecialAmphibiousTank"
  | "LbAttacker"
  | "LbFighter"
  | "LbRecon"
  | "TransportationMaterial"
  | "SubmarineEquipment"
  | "LargeLbAircraft"
  | "JetFighter"
  | "JetFighterBomber"
  | "JetTorpedoBomber"
  | "JetRecon"
  | "LargeRadar2"
  | "CbRecon2"

export type GearAttribute =
  | "HighAngleMount"
  | "NightFighter"
  | "NightAttacker"
  | "HeavyBomber"
  | "MainGun"
  | "Radar"
  | "SurfaceRadar"
  | "AirRadar"
  | "DepthChargeProjector"
  | "AdditionalDepthCharge"
  | "AntiSubMortar"
  | "AntiSubWeapon"
  | "AntiSubAircraft"
  | "Seaplane"
  | "CbAircraft"
  | "LbAircraft"
  | "JetAircraft"
  | "Fighter"
  | "Recon"
  | "ObservationSeaplane"
  | "CbFighterBomber"
  | "AntiInstallationCbBomber"
  | "NightRecon"
  | "CbSwordfish"
  | "SemiNightPlane"
  | "HighAltitudeInterceptor"
